"Full Positive (NDA): \n \n The difference increased by 8.0. \n\nA poll from Friday, February 11. 2022 showed that Isabella Soler (Alliance) was able to achieve 60 percent, while Claudio López (Isidorian Unity Party) reached 40 percent. This produces a margin of 20.0 Points, and shows Isabella Soler leading. There are 0.0 percent undecided voters. So far, the NDA averaged 54.0 points, while their opponents averaged 44.0 points over the last 33 polls. The median is 56.0 (Alliance) and 43.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0.  The New Democratic Alliance are climbing away. The result improves by 5.0 points for the Alliance. The poll numbers decreased by -3.0 points for Claudio López. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. There is a sizeable gap between the two. The margin widens by 8.0. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n Alliance leads Unity Party with 60 to 40 percent \n\nAccording to a poll from Friday, February 11. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 60 percent, while Claudio López (IUP) reached 40 percent. This leaves 20.0 points separating the two, and shows Isabella Soler in first place. As of this date, 0.0 percent of the voters are undecided. Over the last 33 polls, the average for Alliance has been 54.0 points, whereas Unity Party has been averaging 44.0 points. Median results were 56.0 (New Democratic Alliance) and 43.0 (Unity Party). Across all polls, the mean margin is 16.0, and the median 15.0 points.  The New Democratic Alliance are climbing away. The result improves by 5.0 points for the NDA. The Unity Party lost -3.0 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. New Democratic Alliance leads IUP by a large margin. The difference increased by 8.0. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The NDA gains 5.0 percentage points. \n\nAccording to a poll from Friday, February 11. 2022, Isabella Soler (NDA) was able to achieve 60 percent, while Claudio López (IUP) reached 40 percent. This leaves 20.0 points separating the two, and shows Isabella Soler in first place. There are 0.0 percent undecided voters. Over the last 33 polls, the average for NDA has been 54.0 points, whereas IUP has been averaging 44.0 points. Median results were 56.0 (New Democratic Alliance) and 43.0 (Unity Party). Across all polls, the mean margin is 16.0, and the median 15.0 points. Alliance leads Unity Party by a large margin.  The Alliance are climbing away. The result improves by 5.0 points for the NDA. The poll numbers decreased by -3.0 points for Claudio López. The margin widens by 8.0. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Unity Party scores 40, NDA 60 percent.\n\nThe latest poll from Friday, February 11. 2022 showed that Claudio López (Isidorian Unity Party) was able to achieve 40 percent, the New Democratic Alliance on the other hand was able to hit 60 percent. This leaves 20.0 points separating the two, and shows Isabella Soler in first place. There are 0.0 percent undecided voters. Over the last 33 polls, the average for Isidorian Unity Party has been 44.0 points, whereas New Democratic Alliance has been averaging 54.0 points. Median results were 43.0 (Isidorian Unity Party) and 56.0 (New Democratic Alliance).  Across all polls, the mean margin is 16.0, and the median 15.0 points. The lead is getting bigger. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 40, NDA 60 percent.\n\nThe latest poll from Friday, February 11. 2022 showed that Claudio López (IUP) was able to achieve 40 percent, while Claudio López (IUP) reached 60 percent. This produces a margin of 20.0 Points. 0.0 percent of the voters have yet to decide. Across all polls, the mean margin is 16.0, and the median 15.0 points. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022.  \n \n Full Positive (NDA): \n \n The difference increased by 3.2. \n\nIn a poll conducted on Thursday, February 10. 2022, Isabella Soler (NDA) was able to achieve 55 percent, the Unity Party on the other hand was able to hit 43 percent. This leaves 12.0 points separating the two, and shows Isabella Soler leading. So far, 2.0 percent of the voters have no preferred candidate. Over the last 32 polls, the average for NDA has been 54.0 points, whereas IUP has been averaging 44.0 points. Median results were 55.0 (Alliance) and 43.0 (Isidorian Unity Party). Across all polls, the mean margin is 15.0, and the median 14.0 points. The lead is getting bigger. The result improves by 2.0 points for the New Democratic Alliance. The Unity Party lost -1.2 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference increased by 3.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The difference increased by 3.2. \n\nA poll from Thursday, February 10. 2022 showed that Isabella Soler (New Democratic Alliance) was able to achieve 55 percent, while Claudio López (Unity Party) reached 43 percent. This leaves 12.0 points separating the two, and shows Isabella Soler in first place. There are 2.0 percent undecided voters. So far, the New Democratic Alliance averaged 54.0 points, while their opponents averaged 44.0 points over the last 32 polls. The median is 55.0 (New Democratic Alliance) and 43.0 (Unity Party) respectively. The mean margin for all polls is 15.0, the median margin 14.0. The Alliance are widening the gap. The Alliance gains 2.0 percentage points. The Isidorian Unity Party lost -1.2 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The margin widens by 3.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  Isabella Soler in the Lead\n\nThe latest poll from Thursday, February 10. 2022 showed that Isabella Soler (NDA) was able to achieve 55 percent, the Unity Party on the other hand was able to hit 43 percent. This produces a margin of 12.0 Points, with the New Democratic Alliance in first place. 2.0 percent of the voters have yet to decide. So far, the New Democratic Alliance averaged 54.0 points, while their opponents averaged 44.0 points over the last 32 polls. The median is 55.0 (NDA) and 43.0 (Unity Party) respectively. The mean margin for all polls is 15.0, the median margin 14.0.  The New Democratic Alliance are climbing away. The result improves by 2.0 points for the New Democratic Alliance. The poll numbers decreased by -1.2 points for Claudio López. The margin widens by 3.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Unity Party scores 43, Alliance 55 percent.\n\nIn a poll conducted on Thursday, February 10. 2022, Claudio López (Isidorian Unity Party) reached 43 percent, the Alliance on the other hand was able to hit 55 percent. This leaves 12.0 points separating the two, with the Alliance in first place. There are 2.0 percent undecided voters. So far, the IUP averaged 44.0 points, while their opponents averaged 54.0 points over the last 32 polls. The median is 43.0 (Unity Party) and 55.0(NDA) respectively. Across all polls, the mean margin is 15.0, and the median 14.0 points. The Alliance are widening the gap. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n Unity Party scores 43, Alliance 55 percent.\n\nAccording to a poll from Thursday, February 10. 2022, Claudio López (IUP) reached 43 percent, the Alliance on the other hand was able to hit 55 percent. This leaves 12.0 points separating the two. 2.0 percent of the voters have yet to decide. Across all polls, the mean margin is 15.0, and the median 14.0 points. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nAccording to a poll from Wednesday, February 09. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 53 percent, the Unity Party on the other hand was able to hit 44.2 percent. This leaves 8.8 points separating the two, and shows Isabella Soler in first place. As of this date, 2.8 percent of the voters are undecided. So far, the Alliance averaged 54.0 points, while their opponents averaged 45.0 points over the last 31 polls. The median is 56.0 (NDA) and 43.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0. The lead is getting bigger. The result improves by 5.0 points for the New Democratic Alliance. The poll numbers decreased by -2.2 points for Claudio López. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin widens by 7.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The difference increased by 7.2. \n\nIn a poll conducted on Wednesday, February 09. 2022, Isabella Soler (NDA) was able to achieve 53 percent, the IUP on the other hand was able to hit 44.2 percent. This leaves 8.8 points separating the two, with the Alliance in first place. There are 2.8 percent undecided voters. So far, the New Democratic Alliance averaged 54.0 points, while their opponents averaged 45.0 points over the last 31 polls. The median is 56.0 (Alliance) and 43.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0.  The Alliance are climbing away. The New Democratic Alliance gains 5.0 percentage points. The poll numbers decreased by -2.2 points for Claudio López. The NDA's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The difference increased by 7.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The margin widens by 7.2. \n\nAccording to a poll from Wednesday, February 09. 2022, Isabella Soler (Alliance) reached 53 percent, while Claudio López (IUP) reached 44.2 percent. This leaves 8.8 points separating the two, with the New Democratic Alliance in first place. As of this date, 2.8 percent of the voters are undecided. So far, the NDA averaged 54.0 points, while their opponents averaged 45.0 points over the last 31 polls. The median is 56.0 (New Democratic Alliance) and 43.0 (Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0. The lead is getting bigger. The result improves by 5.0 points for the NDA. The poll numbers decreased by -2.2 points for Claudio López. The difference increased by 7.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Isidorian Unity Party scores 44.2, Alliance 53 percent.\n\nThe latest poll from Wednesday, February 09. 2022 showed that Claudio López (Unity Party) reached 44.2 percent, while Isabella Soler (NDA) reached 53 percent. This leaves 8.8 points separating the two, with the NDA in first place. There are 2.8 percent undecided voters. So far, the Unity Party averaged 45.0 points, while their opponents averaged 54.0 points over the last 31 polls. The median is 43.0 (Unity Party) and 56.0(Alliance) respectively. Across all polls, the mean margin is 16.0, and the median 15.0 points. The lead is getting bigger. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n Unity Party scores 44.2, NDA 53 percent.\n\nIn a poll conducted on Wednesday, February 09. 2022, Claudio López (IUP) was able to achieve 44.2 percent, while Claudio López (Isidorian Unity Party) reached 53 percent. This leaves 8.8 points separating the two. As of this date, 2.8 percent of the voters are undecided. Across all polls, the mean margin is 16.0, and the median 15.0 points. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022.  \n \n Full Positive (NDA): \n \n The result improves by 3.7 points for the Alliance. \n\nFollowing a poll from Tuesday, February 08. 2022, Isabella Soler (NDA) reached 48 percent, while Claudio López (Isidorian Unity Party) reached 46.4 percent. This leaves 1.6 points separating the two, and shows Isabella Soler leading. As of this date, 5.6 percent of the voters are undecided. So far, the NDA averaged 54.0 points, while their opponents averaged 45.0 points over the last 30 polls. The median is 56.0 (Alliance) and 43.0 (Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0. This is the second-lowest difference between the two. There is a new leader. The Alliance gains 3.7 percentage points. The IUP lost -5.0 percentage points. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n New Democratic Alliance is currently leading the poll. \n\nFollowing a poll from Tuesday, February 08. 2022, Isabella Soler (Alliance) reached 48 percent, the Unity Party on the other hand was able to hit 46.4 percent. This produces a margin of 1.6 Points, and shows Isabella Soler leading. There are 5.6 percent undecided voters. Over the last 30 polls, the average for New Democratic Alliance has been 54.0 points, whereas Unity Party has been averaging 45.0 points. Median results were 56.0 (New Democratic Alliance) and 43.0 (Unity Party). Across all polls, the mean margin is 16.0, and the median 15.0 points. It marks the second smallest margin between the two. The poll leader has changed. The result improves by 3.7 points for the NDA. The Isidorian Unity Party lost -5.0 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 60.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The poll numbers decreased by -5.0 points for Claudio López. \n\nThe latest poll from Tuesday, February 08. 2022 showed that Isabella Soler (Alliance) was able to achieve 48 percent, while Claudio López (Unity Party) reached 46.4 percent. This produces a margin of 1.6 Points, and shows Isabella Soler in first place. There are 5.6 percent undecided voters. Over the last 30 polls, the average for Alliance has been 54.0 points, whereas IUP has been averaging 45.0 points. Median results were 56.0 (NDA) and 43.0 (Unity Party). The mean margin for all polls is 16.0, the median margin 15.0. The difference between the two is rather small. It marks the second smallest margin between the two. The lead is shrinking. The NDA is now winning. NDA retook the lead. The NDA gains 3.7 percentage points. The IUP lost -5.0 percentage points. The difference decreased by -5.5. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The margin narrows by -5.5. \n\nFollowing a poll from Tuesday, February 08. 2022, Claudio López (Unity Party) was able to achieve 46.4 percent, the New Democratic Alliance on the other hand was able to hit 48 percent. This leaves 1.6 points separating the two, and shows Isabella Soler in first place. As of this date, 5.6 percent of the voters are undecided. Over the last 30 polls, the average for Unity Party has been 45.0 points, whereas NDA has been averaging 54.0 points. Median results were 43.0 (Unity Party) and 56.0 (Alliance).  The mean margin for all polls is 16.0, the median margin 15.0. The IUP is catching up. The IUP's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The difference between the two is rather small. The margin narrows by -5.5. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The difference decreased by -5.5. \n\nAccording to a poll from Tuesday, February 08. 2022, Claudio López (Isidorian Unity Party) reached 46.4 percent, the Alliance on the other hand was able to hit 48 percent. This produces a margin of 1.6 Points. As of this date, 5.6 percent of the voters are undecided. Across all polls, the mean margin is 16.0, and the median 15.0 points. The gap is getting smaller. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The difference between the two is rather small. The difference decreased by -5.5.  \n \n Full Positive (NDA): \n \n The result improves by 1.3 points for the New Democratic Alliance. \n\nAccording to a poll from Monday, February 07. 2022, Isabella Soler (Alliance) was able to achieve 44.3 percent, while Claudio López (IUP) reached 51.4 percent. This leaves 7.1 points separating the two. 4.3 percent of the voters have yet to decide. Over the last 29 polls, the average for New Democratic Alliance has been 54.0 points, whereas Isidorian Unity Party has been averaging 44.0 points. Median results were 56.0 (Alliance) and 42.0 (Unity Party). Across all polls, the mean margin is 16.0, and the median 15.0 points. The margin is decreasing. The IUP lost -5.6 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -6.9. The Alliance had a local low point in the previous poll at 43.0, and is now rising. After hitting a local high point, Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The result improves by 1.3 points for the Alliance. \n\nThe latest poll from Monday, February 07. 2022 showed that Isabella Soler (Alliance) reached 44.3 percent, while Claudio López (IUP) reached 51.4 percent. This leaves 7.1 points separating the two. As of this date, 4.3 percent of the voters are undecided. So far, the Alliance averaged 54.0 points, while their opponents averaged 44.0 points over the last 29 polls. The median is 56.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 15.0. The gap is getting smaller. The poll numbers decreased by -5.6 points for Claudio López. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The margin narrows by -6.9. The New Democratic Alliance had a local low point in the previous poll at 43.0, and is now rising. After hitting a local high point, Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The New Democratic Alliance gains 1.3 percentage points. \n\nAccording to a poll from Monday, February 07. 2022, Claudio López (Unity Party) reached 51.4 percent, while Isabella Soler (Alliance) reached 44.3 percent. This leaves 7.1 points separating the two, and shows Claudio López in first place. There are 4.3 percent undecided voters. Over the last 29 polls, the average for Isidorian Unity Party has been 44.0 points, whereas NDA has been averaging 54.0 points. Median results were 42.0 (Isidorian Unity Party) and 56.0 (Alliance).  The mean margin for all polls is 16.0, the median margin 15.0. The lead is shrinking. The New Democratic Alliance gains 1.3 percentage points. The Unity Party lost -5.6 percentage points. The margin narrows by -6.9. The New Democratic Alliance had a local low point in the previous poll at 43.0, and is now rising. After hitting a local high point, Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Claudio López in the Lead\n\nThe latest poll from Monday, February 07. 2022 showed that Claudio López (Unity Party) reached 51.4 percent, while Isabella Soler (NDA) reached 44.3 percent. This produces a margin of 7.1 Points, and shows Claudio López in first place. So far, 4.3 percent of the voters have no preferred candidate. Over the last 29 polls, the average for Isidorian Unity Party has been 44.0 points, whereas Alliance has been averaging 54.0 points. Median results were 42.0 (IUP) and 56.0 (Alliance).  Across all polls, the mean margin is 16.0, and the median 15.0 points. The lead is shrinking. The IUP's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party leads Alliance with 51.4 to 44.3 percent \n\nA poll from Monday, February 07. 2022 showed that Claudio López (Unity Party) was able to achieve 51.4 percent, while Claudio López (Unity Party) reached 44.3 percent. This produces a margin of 7.1 Points, and shows the IUP's candidate in first place. 4.3 percent of the voters have yet to decide. The mean margin for all polls is 16.0, the median margin 15.0. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022.  \n \n Full Positive (NDA): \n \n Alliance scores 43, IUP 57 percent.\n\nFollowing a poll from Sunday, February 06. 2022, Isabella Soler (NDA) was able to achieve 43 percent, while Claudio López (Isidorian Unity Party) reached 57 percent. This produces a margin of 14.0 Points. There are 0.0 percent undecided voters. Over the last 28 polls, the average for NDA has been 55.0 points, whereas Isidorian Unity Party has been averaging 44.0 points. Median results were 56.0 (Alliance) and 42.0 (Isidorian Unity Party). The mean margin for all polls is 17.0, the median margin 16.0. The poll numbers decreased by -1.0 points for Isabella Soler. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n NDA scores 43, IUP 57 percent.\n\nAccording to a poll from Sunday, February 06. 2022, Isabella Soler (Alliance) was able to achieve 43 percent, while Claudio López (Unity Party) reached 57 percent. This leaves 14.0 points separating the two. As of this date, 0.0 percent of the voters are undecided. So far, the NDA averaged 55.0 points, while their opponents averaged 44.0 points over the last 28 polls. The median is 56.0 (Alliance) and 42.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 17.0, the median margin 16.0. The New Democratic Alliance lost -1.0 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  Claudio López in the Lead\n\nIn a poll conducted on Sunday, February 06. 2022, Claudio López (Unity Party) reached 57 percent, the NDA on the other hand was able to hit 43 percent. This produces a margin of 14.0 Points, and shows Claudio López in first place. There are 0.0 percent undecided voters. Over the last 28 polls, the average for Unity Party has been 44.0 points, whereas New Democratic Alliance has been averaging 55.0 points. Median results were 42.0 (Unity Party) and 56.0 (New Democratic Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points. The lead is increasing. The NDA lost -1.0 percentage points. The IUP gains 3.7 percentage points. The difference increased by 4.7. The Unity Party had a low point in the previous poll at 53.3, but is now improving again. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The IUP's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The IUP gains 3.7 percentage points. \n\nThe latest poll from Sunday, February 06. 2022 showed that Claudio López (Unity Party) was able to achieve 57 percent, while Isabella Soler (NDA) reached 43 percent. This leaves 14.0 points separating the two, with the Isidorian Unity Party in first place. 0.0 percent of the voters have yet to decide. Over the last 28 polls, the average for Unity Party has been 44.0 points, whereas NDA has been averaging 55.0 points. Median results were 42.0 (Unity Party) and 56.0 (Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points. The lead is increasing. The IUP gains 3.7 percentage points. The Alliance lost -1.0 percentage points. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin widens by 4.7. The IUP had a low point in the previous poll at 53.3, but is now improving again. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n The IUP gains 3.7 percentage points. \n\nFollowing a poll from Sunday, February 06. 2022, Claudio López (Unity Party) was able to achieve 57 percent, while Claudio López (Unity Party) reached 43 percent. This produces a margin of 14.0 Points, and shows the Unity Party's candidate in first place. As of this date, 0.0 percent of the voters are undecided. The mean margin for all polls is 17.0, the median margin 16.0. The lead is increasing. The result improves by 3.7 points for the Unity Party. The Alliance lost -1.0 percentage points. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The difference increased by 4.7. The Isidorian Unity Party had a low point in the previous poll at 53.3, but is now improving again.  \n \n Full Positive (NDA): \n \n The difference decreased by -0.7. \n\nA poll from Saturday, February 05. 2022 showed that Isabella Soler (Alliance) was able to achieve 44 percent, while Claudio López (IUP) reached 53.3 percent. This leaves 9.3 points separating the two. There are 2.7 percent undecided voters. Over the last 27 polls, the average for NDA has been 55.0 points, whereas IUP has been averaging 44.0 points. Median results were 57.0 (New Democratic Alliance) and 42.0 (Unity Party). Across all polls, the mean margin is 17.0, and the median 16.0 points.  The Alliance is inching up to the Isidorian Unity Party. The poll numbers decreased by -1.0 points for Isabella Soler. The IUP lost -1.7 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -0.7. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The difference decreased by -0.7. \n\nA poll from Saturday, February 05. 2022 showed that Isabella Soler (Alliance) was able to achieve 44 percent, while Claudio López (Isidorian Unity Party) reached 53.3 percent. This leaves 9.3 points separating the two. 2.7 percent of the voters have yet to decide. So far, the NDA averaged 55.0 points, while their opponents averaged 44.0 points over the last 27 polls. The median is 57.0 (Alliance) and 42.0 (IUP) respectively. Across all polls, the mean margin is 17.0, and the median 16.0 points. The lead is shrinking. The NDA lost -1.0 percentage points. The poll numbers decreased by -1.7 points for Claudio López. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The difference decreased by -0.7. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  IUP leads Alliance with 53.3 to 44 percent \n\nThe latest poll from Saturday, February 05. 2022 showed that Claudio López (Unity Party) reached 53.3 percent, while Isabella Soler (Alliance) reached 44 percent. This leaves 9.3 points separating the two, and shows Claudio López leading. 2.7 percent of the voters have yet to decide. So far, the Unity Party averaged 44.0 points, while their opponents averaged 55.0 points over the last 27 polls. The median is 42.0 (Unity Party) and 57.0(New Democratic Alliance) respectively. The mean margin for all polls is 17.0, the median margin 16.0.  The New Democratic Alliance is inching up to the Isidorian Unity Party. The Alliance lost -1.0 percentage points. The poll numbers decreased by -1.7 points for Claudio López. The margin narrows by -0.7. After hitting a local high point, New Democratic Alliance's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The poll numbers decreased by -1.0 points for Isabella Soler. \n\nA poll from Saturday, February 05. 2022 showed that Claudio López (IUP) was able to achieve 53.3 percent, while Isabella Soler (Alliance) reached 44 percent. This produces a margin of 9.3 Points, with the Unity Party in first place. There are 2.7 percent undecided voters. Over the last 27 polls, the average for Isidorian Unity Party has been 44.0 points, whereas NDA has been averaging 55.0 points. Median results were 42.0 (Isidorian Unity Party) and 57.0 (Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points.  The NDA is inching up to the Unity Party. The poll numbers decreased by -1.0 points for Isabella Soler. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. After hitting a local high point, New Democratic Alliance's results are now decreasing. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Claudio López in the Lead\n\nIn a poll conducted on Saturday, February 05. 2022, Claudio López (Isidorian Unity Party) reached 53.3 percent, while Claudio López (IUP) reached 44 percent. This produces a margin of 9.3 Points, and shows the IUP's candidate leading. There are 2.7 percent undecided voters. The mean margin for all polls is 17.0, the median margin 16.0. The New Democratic Alliance lost -1.0 percentage points. The IUP's highest ever result, 60.0 was on February 02. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Alliance had a local high point in the previous poll at 45.0, and is now sinking.  \n \n Full Positive (NDA): \n \n The NDA gains 4.0 percentage points. \n\nA poll from Friday, February 04. 2022 showed that Isabella Soler (Alliance) reached 45 percent, the Isidorian Unity Party on the other hand was able to hit 55 percent. This produces a margin of 10.0 Points. 0.0 percent of the voters have yet to decide. Over the last 26 polls, the average for New Democratic Alliance has been 56.0 points, whereas Unity Party has been averaging 43.0 points. Median results were 57.0 (NDA) and 42.0 (IUP). The mean margin for all polls is 17.0, the median margin 16.0.  The NDA is inching up to the Isidorian Unity Party. The Unity Party lost -2.2 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -6.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The IUP lost -2.2 percentage points. \n\nThe latest poll from Friday, February 04. 2022 showed that Isabella Soler (Alliance) reached 45 percent, while Claudio López (IUP) reached 55 percent. This produces a margin of 10.0 Points. So far, 0.0 percent of the voters have no preferred candidate. Over the last 26 polls, the average for Alliance has been 56.0 points, whereas Unity Party has been averaging 43.0 points. Median results were 57.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party). The mean margin for all polls is 17.0, the median margin 16.0. The gap is getting tighter. The IUP lost -2.2 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The margin narrows by -6.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  IUP leads New Democratic Alliance with 55 to 45 percent \n\nThe latest poll from Friday, February 04. 2022 showed that Claudio López (IUP) was able to achieve 55 percent, while Isabella Soler (New Democratic Alliance) reached 45 percent. This produces a margin of 10.0 Points, and shows Claudio López in first place. As of this date, 0.0 percent of the voters are undecided. Over the last 26 polls, the average for Isidorian Unity Party has been 43.0 points, whereas New Democratic Alliance has been averaging 56.0 points. Median results were 42.0 (Unity Party) and 57.0 (New Democratic Alliance).  The mean margin for all polls is 17.0, the median margin 16.0. The gap is getting smaller. The result improves by 4.0 points for the Alliance. The poll numbers decreased by -2.2 points for Claudio López. The margin narrows by -6.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The IUP's highest ever result, 60.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Unity Party leads New Democratic Alliance with 55 to 45 percent \n\nThe latest poll from Friday, February 04. 2022 showed that Claudio López (Isidorian Unity Party) reached 55 percent, while Isabella Soler (Alliance) reached 45 percent. This produces a margin of 10.0 Points, with the Unity Party in first place. As of this date, 0.0 percent of the voters are undecided. Over the last 26 polls, the average for Isidorian Unity Party has been 43.0 points, whereas New Democratic Alliance has been averaging 56.0 points. Median results were 42.0 (Isidorian Unity Party) and 57.0 (Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points.  The NDA is inching up to the Unity Party. The IUP's highest ever result, 60.0 was on February 02. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n Claudio López in the Lead\n\nFollowing a poll from Friday, February 04. 2022, Claudio López (IUP) reached 55 percent, while Claudio López (IUP) reached 45 percent. This leaves 10.0 points separating the two, and shows the Unity Party's candidate in first place. As of this date, 0.0 percent of the voters are undecided. The mean margin for all polls is 17.0, the median margin 16.0. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022.  \n \n Full Positive (NDA): \n \n The poll numbers decreased by -2.8 points for Claudio López. \n\nIn a poll conducted on Thursday, February 03. 2022, Isabella Soler (New Democratic Alliance) reached 41 percent, while Claudio López (IUP) reached 57.2 percent. This produces a margin of 16.2 Points. As of this date, 1.8 percent of the voters are undecided. Over the last 25 polls, the average for NDA has been 56.0 points, whereas IUP has been averaging 43.0 points. Median results were 57.0 (New Democratic Alliance) and 42.0 (Unity Party). The mean margin for all polls is 17.0, the median margin 16.0. It is one of the worst results so far. The gap is getting smaller. The poll numbers decreased by -2.8 points for Claudio López. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin narrows by -3.8. The New Democratic Alliance had a local low point in the previous poll at 40.0, and is now rising. After hitting a local high point, Isidorian Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Half Positive (NDA) \n \n The poll numbers decreased by -2.8 points for Claudio López. \n\nIn a poll conducted on Thursday, February 03. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 41 percent, while Claudio López (Unity Party) reached 57.2 percent. This produces a margin of 16.2 Points. 1.8 percent of the voters have yet to decide. Over the last 25 polls, the average for Alliance has been 56.0 points, whereas Unity Party has been averaging 43.0 points. Median results were 57.0 (Alliance) and 42.0 (IUP). The mean margin for all polls is 17.0, the median margin 16.0. It is one of the worst results so far.  The Alliance is inching up to the Unity Party. The IUP lost -2.8 percentage points. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The margin narrows by -3.8. The NDA had a local low point in the previous poll at 40.0, and is now rising. The Unity Party had a local peak in the previous poll at 60.0, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  Claudio López in the Lead\n\nAccording to a poll from Thursday, February 03. 2022, Claudio López (Unity Party) was able to achieve 57.2 percent, the Alliance on the other hand was able to hit 41 percent. This leaves 16.2 points separating the two, with the Isidorian Unity Party in first place. 1.8 percent of the voters have yet to decide. Over the last 25 polls, the average for IUP has been 43.0 points, whereas NDA has been averaging 56.0 points. Median results were 42.0 (IUP) and 57.0 (New Democratic Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points. There is a lot of catching up to do for Alliance. The Alliance is catching up. The result improves by 1.0 points for the New Democratic Alliance. The IUP lost -2.8 percentage points. The margin narrows by -3.8. The New Democratic Alliance had a local low point in the previous poll at 40.0, and is now rising. The Unity Party had a local peak in the previous poll at 60.0, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n IUP leads Alliance with 57.2 to 41 percent \n\nAccording to a poll from Thursday, February 03. 2022, Claudio López (Isidorian Unity Party) reached 57.2 percent, the New Democratic Alliance on the other hand was able to hit 41 percent. This produces a margin of 16.2 Points, and shows Claudio López in first place. So far, 1.8 percent of the voters have no preferred candidate. Over the last 25 polls, the average for IUP has been 43.0 points, whereas New Democratic Alliance has been averaging 56.0 points. Median results were 42.0 (Unity Party) and 57.0 (Alliance).  Across all polls, the mean margin is 17.0, and the median 16.0 points. The Alliance is catching up. The IUP's highest ever result, 60.0 was on February 02. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a sizeable gap between the two. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n Claudio López in the Lead\n\nIn a poll conducted on Thursday, February 03. 2022, Claudio López (IUP) reached 57.2 percent, the Alliance on the other hand was able to hit 41 percent. This leaves 16.2 points separating the two, and shows the IUP's candidate in first place. As of this date, 1.8 percent of the voters are undecided. Across all polls, the mean margin is 17.0, and the median 16.0 points. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. IUP leads Alliance by a large margin.  \n \n Full Positive (NDA): \n \n New Democratic Alliance scores 40, IUP 60 percent.\n\nThe latest poll from Wednesday, February 02. 2022 showed that Isabella Soler (Alliance) was able to achieve 40 percent, while Claudio López (IUP) reached 60 percent. This leaves 20.0 points separating the two. As of this date, 0.0 percent of the voters are undecided. Over the last 24 polls, the average for NDA has been 57.0 points, whereas IUP has been averaging 42.0 points. Median results were 57.0 (Alliance) and 42.0 (Isidorian Unity Party). Across all polls, the mean margin is 17.0, and the median 17.0 points. The poll numbers decreased by -4.0 points for Isabella Soler. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n NDA scores 40, Unity Party 60 percent.\n\nA poll from Wednesday, February 02. 2022 showed that Isabella Soler (New Democratic Alliance) reached 40 percent, while Claudio López (Unity Party) reached 60 percent. This produces a margin of 20.0 Points. As of this date, 0.0 percent of the voters are undecided. So far, the NDA averaged 57.0 points, while their opponents averaged 42.0 points over the last 24 polls. The median is 57.0 (Alliance) and 42.0 (IUP) respectively. The mean margin for all polls is 17.0, the median margin 17.0. The poll numbers decreased by -4.0 points for Isabella Soler. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 60.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  The margin widens by 9.0. \n\nA poll from Wednesday, February 02. 2022 showed that Claudio López (IUP) reached 60 percent, while Isabella Soler (NDA) reached 40 percent. This produces a margin of 20.0 Points, and shows Claudio López leading. So far, 0.0 percent of the voters have no preferred candidate. Over the last 24 polls, the average for IUP has been 42.0 points, whereas New Democratic Alliance has been averaging 57.0 points. Median results were 42.0 (Isidorian Unity Party) and 57.0 (New Democratic Alliance).  The mean margin for all polls is 17.0, the median margin 17.0. Isidorian Unity Party leads NDA by a large margin. The points have hit rock bottom for the Alliance. The Isidorian Unity Party are widening the gap. The Alliance lost -4.0 percentage points. The result improves by 5.0 points for the IUP. The margin widens by 9.0. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's highest ever result, 60.0 was on February 02. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The margin widens by 9.0. \n\nFollowing a poll from Wednesday, February 02. 2022, Claudio López (Isidorian Unity Party) reached 60 percent, the Alliance on the other hand was able to hit 40 percent. This leaves 20.0 points separating the two, with the Unity Party in first place. As of this date, 0.0 percent of the voters are undecided. So far, the Unity Party averaged 42.0 points, while their opponents averaged 57.0 points over the last 24 polls. The median is 42.0 (IUP) and 57.0(Alliance) respectively. Across all polls, the mean margin is 17.0, and the median 17.0 points.  The Unity Party are climbing away. The result improves by 5.0 points for the IUP. The New Democratic Alliance lost -4.0 percentage points. The IUP's highest ever result, 60.0 was on February 02. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 40.0 was on February 02. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a sizeable gap between the two. The margin widens by 9.0. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The Unity Party gains 5.0 percentage points. \n\nIn a poll conducted on Wednesday, February 02. 2022, Claudio López (Isidorian Unity Party) reached 60 percent, while Claudio López (IUP) reached 40 percent. This produces a margin of 20.0 Points, and shows the Isidorian Unity Party's candidate leading. So far, 0.0 percent of the voters have no preferred candidate. Across all polls, the mean margin is 17.0, and the median 17.0 points. The lead is getting bigger. The Unity Party gains 5.0 percentage points. The poll numbers decreased by -4.0 points for Isabella Soler. The IUP's highest ever result, 60.0 was on February 02. 2022. The New Democratic Alliance's lowest ever result, 40.0 was on February 02. 2022. Isidorian Unity Party leads New Democratic Alliance by a large margin. The margin widens by 9.0.  \n \n Full Positive (NDA): \n \n Alliance scores 44, Isidorian Unity Party 55 percent.\n\nIn a poll conducted on Tuesday, February 01. 2022, Isabella Soler (NDA) was able to achieve 44 percent, the Unity Party on the other hand was able to hit 55 percent. This produces a margin of 11.0 Points. As of this date, 1.0 percent of the voters are undecided. So far, the Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 23 polls. The median is 58.0 (New Democratic Alliance) and 41.0 (IUP) respectively. Across all polls, the mean margin is 17.0, and the median 16.0 points. The poll numbers decreased by -7.3 points for Isabella Soler. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n Alliance scores 44, Unity Party 55 percent.\n\nFollowing a poll from Tuesday, February 01. 2022, Isabella Soler (Alliance) was able to achieve 44 percent, the Isidorian Unity Party on the other hand was able to hit 55 percent. This produces a margin of 11.0 Points. So far, 1.0 percent of the voters have no preferred candidate. Over the last 23 polls, the average for New Democratic Alliance has been 57.0 points, whereas Isidorian Unity Party has been averaging 42.0 points. Median results were 58.0 (New Democratic Alliance) and 41.0 (IUP). Across all polls, the mean margin is 17.0, and the median 16.0 points. The poll numbers decreased by -7.3 points for Isabella Soler. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 55.0 was on February 01. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 44.0 was on February 01. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The Isidorian Unity Party gains 6.9 percentage points. \n\nThe latest poll from Tuesday, February 01. 2022 showed that Claudio López (IUP) reached 55 percent, while Isabella Soler (Alliance) reached 44 percent. This produces a margin of 11.0 Points, with the IUP in first place. There are 1.0 percent undecided voters. Over the last 23 polls, the average for Isidorian Unity Party has been 42.0 points, whereas New Democratic Alliance has been averaging 57.0 points. Median results were 41.0 (IUP) and 58.0 (NDA).  Across all polls, the mean margin is 17.0, and the median 16.0 points. This is a historically low result for the NDA. The IUP are widening the gap. The Alliance are now losing. IUP retook the lead. The poll numbers decreased by -7.3 points for Isabella Soler. The result improves by 6.9 points for the IUP. The difference increased by 7.8. After hitting a local high point, Alliance's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 44.0 was on February 01. 2022. The Unity Party's highest ever result, 55.0 was on February 01. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The Isidorian Unity Party is winning right now. \n\nAccording to a poll from Tuesday, February 01. 2022, Claudio López (IUP) reached 55 percent, while Isabella Soler (New Democratic Alliance) reached 44 percent. This leaves 11.0 points separating the two, and shows Claudio López in first place. As of this date, 1.0 percent of the voters are undecided. So far, the IUP averaged 42.0 points, while their opponents averaged 57.0 points over the last 23 polls. The median is 41.0 (Unity Party) and 58.0(New Democratic Alliance) respectively. The mean margin for all polls is 17.0, the median margin 16.0. The lead is getting bigger. The NDA are now losing. The Unity Party gains 6.9 percentage points. The NDA lost -7.3 percentage points. The IUP's highest ever result, 55.0 was on February 01. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 44.0 was on February 01. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin widens by 7.8. After hitting a local high point, Alliance's results are now decreasing. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The result improves by 6.9 points for the Unity Party. \n\nAccording to a poll from Tuesday, February 01. 2022, Claudio López (IUP) was able to achieve 55 percent, the NDA on the other hand was able to hit 44 percent. This produces a margin of 11.0 Points, with the IUP candidate in first place. There are 1.0 percent undecided voters. Across all polls, the mean margin is 17.0, and the median 16.0 points. The IUP are widening the gap. The IUP overtook the Alliance. The result improves by 6.9 points for the Unity Party. The poll numbers decreased by -7.3 points for Isabella Soler. The Isidorian Unity Party's highest ever result, 55.0 was on February 01. 2022. The New Democratic Alliance's lowest ever result, 44.0 was on February 01. 2022. The margin widens by 7.8. After hitting a local high point, NDA's results are now decreasing.  \n \n Full Positive (NDA): \n \n The difference increased by 3.2. \n\nIn a poll conducted on Monday, January 31. 2022, Isabella Soler (Alliance) was able to achieve 51.3 percent, while Claudio López (Unity Party) reached 48.1 percent. This leaves 3.2 points separating the two, and shows Isabella Soler in first place. So far, 0.6 percent of the voters have no preferred candidate. So far, the New Democratic Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 22 polls. The median is 58.0 (NDA) and 41.0 (IUP) respectively. The mean margin for all polls is 17.0, the median margin 17.0.  The NDA are climbing away. The Unity Party are now losing. The result improves by 3.3 points for the New Democratic Alliance. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference increased by 3.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The margin widens by 3.2. \n\nA poll from Monday, January 31. 2022 showed that Isabella Soler (Alliance) reached 51.3 percent, the Unity Party on the other hand was able to hit 48.1 percent. This produces a margin of 3.2 Points, and shows Isabella Soler in first place. There are 0.6 percent undecided voters. Over the last 22 polls, the average for New Democratic Alliance has been 58.0 points, whereas IUP has been averaging 41.0 points. Median results were 58.0 (NDA) and 41.0 (Unity Party). Across all polls, the mean margin is 17.0, and the median 17.0 points. The Alliance are widening the gap. Alliance is now in the lead. The result improves by 3.3 points for the Alliance. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 52.0 was on January 29. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022. The margin widens by 3.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The difference increased by 3.2. \n\nFollowing a poll from Monday, January 31. 2022, Isabella Soler (Alliance) reached 51.3 percent, while Claudio López (Isidorian Unity Party) reached 48.1 percent. This leaves 3.2 points separating the two, and shows Isabella Soler in first place. So far, 0.6 percent of the voters have no preferred candidate. So far, the New Democratic Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 22 polls. The median is 58.0 (New Democratic Alliance) and 41.0 (IUP) respectively. Across all polls, the mean margin is 17.0, and the median 17.0 points. It is a neck and neck race. The lead is getting bigger. There is a new winner. NDA is now leading again. The result improves by 3.3 points for the Alliance. The Isidorian Unity Party gains 0.1 percentage points. The margin widens by 3.2. The IUP had a low point in the previous poll at 48.0, but is now improving again. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 48.0 was on January 29. 2022. The IUP's highest ever result, 52.0 was on January 29. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Alliance is the frontrunner. \n\nA poll from Monday, January 31. 2022 showed that Claudio López (Unity Party) reached 48.1 percent, while Isabella Soler (Alliance) reached 51.3 percent. This leaves 3.2 points separating the two, with the Alliance in first place. As of this date, 0.6 percent of the voters are undecided. So far, the IUP averaged 41.0 points, while their opponents averaged 58.0 points over the last 22 polls. The median is 41.0 (IUP) and 58.0(NDA) respectively. Across all polls, the mean margin is 17.0, and the median 17.0 points.  The Alliance are climbing away. The result improves by 0.1 points for the Unity Party. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 48.0 was on January 29. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference between the two is rather small. The Isidorian Unity Party had a low point in the previous poll at 48.0, but is now improving again. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 48.1, New Democratic Alliance 51.3 percent.\n\nIn a poll conducted on Monday, January 31. 2022, Claudio López (Unity Party) was able to achieve 48.1 percent, the Alliance on the other hand was able to hit 51.3 percent. This produces a margin of 3.2 Points. As of this date, 0.6 percent of the voters are undecided. Across all polls, the mean margin is 17.0, and the median 17.0 points. The Isidorian Unity Party gains 0.1 percentage points. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022. It is a neck and neck race. The IUP had a low point in the previous poll at 48.0, but is now improving again.  \n \n Full Positive (NDA): \n \n No Leader in the Current Survey\n\nFollowing a poll from Sunday, January 30. 2022, Isabella Soler (Alliance) was able to achieve 48 percent, the IUP on the other hand was able to hit 48 percent. This produces a margin of 0.0 Points. So far, 4.0 percent of the voters have no preferred candidate. Over the last 21 polls, the average for NDA has been 58.0 points, whereas Isidorian Unity Party has been averaging 41.0 points. Median results were 58.0 (NDA) and 41.0 (Isidorian Unity Party). Across all polls, the mean margin is 18.0, and the median 18.0 points. The contestants are separated by a hair thin margin. The gap is getting smaller. The Isidorian Unity Party lost -4.0 percentage points. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. It is a neck and neck race. The difference decreased by -4.0. The IUP had a local peak in the previous poll at 52.0, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Half Positive (NDA) \n \n The NDA is winning right now. \n\nFollowing a poll from Sunday, January 30. 2022, Isabella Soler (NDA) reached 48 percent, while Claudio López (Unity Party) reached 48 percent. This leaves 0.0 points separating the two. As of this date, 4.0 percent of the voters are undecided. So far, the New Democratic Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 21 polls. The median is 58.0 (New Democratic Alliance) and 41.0  (IUP) respectively. The mean margin for all polls is 18.0, the median margin 18.0. The contestants are separated by a hair thin margin. The gap is getting smaller. The poll numbers decreased by -4.0 points for Claudio López. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 52.0 was on January 29. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 48.0 was on January 29. 2022. NDA and Unity Party are close together. Both parties scored the same result. The difference decreased by -4.0. After hitting a local high point, Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  The NDA is winning right now. \n\nFollowing a poll from Sunday, January 30. 2022, Isabella Soler (New Democratic Alliance) reached 48 percent, while Claudio López (IUP) reached 48 percent. This leaves 0.0 points separating the two, with the NDA in first place. As of this date, 4.0 percent of the voters are undecided. So far, the Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 21 polls. The median is 58.0 (Alliance) and 41.0  (Unity Party) respectively. The mean margin for all polls is 18.0, the median margin 18.0. Both parties scored the same result. The points have hit rock bottom for the New Democratic Alliance. The race has never been this close. The lead is shrinking. The poll numbers decreased by -4.0 points for Claudio López. The difference decreased by -4.0. After hitting a local high point, Isidorian Unity Party's results are now decreasing. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 30. 2022, when only 0.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n No Leader in the Current Survey\n\nIn a poll conducted on Sunday, January 30. 2022, Claudio López (Unity Party) was able to achieve 48 percent, while Isabella Soler (Alliance) reached 48 percent. This leaves 0.0 points separating the two, and shows Claudio López leading. There are 4.0 percent undecided voters. Over the last 21 polls, the average for Unity Party has been 41.0 points, whereas Alliance has been averaging 58.0 points. Median results were 41.0 (Unity Party) and 58.0 (New Democratic Alliance).  The mean margin for all polls is 18.0, the median margin 18.0. The gap is getting smaller. There is a new winner. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. Both parties scored the same result. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Both parties achieve the same result\n\nA poll from Sunday, January 30. 2022 showed that Claudio López (Isidorian Unity Party) reached 48 percent, the Alliance on the other hand was able to hit 48 percent. This leaves 0.0 points separating the two, with the Unity Party candidate in first place. As of this date, 4.0 percent of the voters are undecided. The mean margin for all polls is 18.0, the median margin 18.0. The NDA are now losing. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022.  \n \n Full Positive (NDA): \n \n Alliance scores 48, IUP 52 percent.\n\nA poll from Saturday, January 29. 2022 showed that Isabella Soler (Alliance) was able to achieve 48 percent, while Claudio López (Isidorian Unity Party) reached 52 percent. This leaves 4.0 points separating the two. So far, 0.0 percent of the voters have no preferred candidate. Over the last 20 polls, the average for Alliance has been 59.0 points, whereas Unity Party has been averaging 40.0 points. Median results were 59.0 (NDA) and 40.0 (Unity Party). Across all polls, the mean margin is 19.0, and the median 19.0 points. This is the second-lowest difference between the two. The poll numbers decreased by -2.2 points for Isabella Soler. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The difference between the two is rather small. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The Isidorian Unity Party is winning right now. \n\nA poll from Saturday, January 29. 2022 showed that Isabella Soler (New Democratic Alliance) reached 48 percent, the IUP on the other hand was able to hit 52 percent. This produces a margin of 4.0 Points. So far, 0.0 percent of the voters have no preferred candidate. Over the last 20 polls, the average for Alliance has been 59.0 points, whereas Unity Party has been averaging 40.0 points. Median results were 59.0 (New Democratic Alliance) and 40.0 (Unity Party). Across all polls, the mean margin is 19.0, and the median 19.0 points. It marks the second smallest margin between the two. The NDA lost -2.2 percentage points. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 52.0 was on January 29. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The New Democratic Alliance's lowest ever result, 48.0 was on January 29. 2022. It is a neck and neck race. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  IUP leads the poll. \n\nIn a poll conducted on Saturday, January 29. 2022, Claudio López (Unity Party) was able to achieve 52 percent, while Isabella Soler (NDA) reached 48 percent. This leaves 4.0 points separating the two, with the IUP in first place. There are 0.0 percent undecided voters. Over the last 20 polls, the average for IUP has been 40.0 points, whereas NDA has been averaging 59.0 points. Median results were 40.0 (IUP) and 59.0 (NDA).  The mean margin for all polls is 19.0, the median margin 19.0. NDA and Unity Party are close together. This is a historically low result for the Alliance. It marks the second smallest margin between the two.  The IUP are climbing away. The IUP overtook the NDA. IUP retook the lead. The poll numbers decreased by -2.2 points for Isabella Soler. The Unity Party gains 3.9 percentage points. The difference increased by 1.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 48.0 was on January 29. 2022. The Isidorian Unity Party's highest ever result, 52.0 was on January 29. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The difference increased by 1.9. \n\nFollowing a poll from Saturday, January 29. 2022, Claudio López (Isidorian Unity Party) reached 52 percent, while Isabella Soler (Alliance) reached 48 percent. This produces a margin of 4.0 Points, and shows Claudio López in first place. 0.0 percent of the voters have yet to decide. Over the last 20 polls, the average for IUP has been 40.0 points, whereas Alliance has been averaging 59.0 points. Median results were 40.0 (IUP) and 59.0 (New Democratic Alliance).  Across all polls, the mean margin is 19.0, and the median 19.0 points. The lead is getting bigger. The poll leader has changed. The result improves by 3.9 points for the IUP. The New Democratic Alliance lost -2.2 percentage points. The Unity Party's highest ever result, 52.0 was on January 29. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 48.0 was on January 29. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin widens by 1.9. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Claudio López in the Lead\n\nIn a poll conducted on Saturday, January 29. 2022, Claudio López (Unity Party) reached 52 percent, the New Democratic Alliance on the other hand was able to hit 48 percent. This produces a margin of 4.0 Points, with the IUP candidate in first place. There are 0.0 percent undecided voters. The mean margin for all polls is 19.0, the median margin 19.0. The lead is getting bigger. There is a new winner. The Isidorian Unity Party gains 3.9 percentage points. The poll numbers decreased by -2.2 points for Isabella Soler. The IUP's highest ever result, 52.0 was on January 29. 2022. The NDA's lowest ever result, 48.0 was on January 29. 2022. The difference increased by 1.9. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nFollowing a poll from Friday, January 28. 2022, Isabella Soler (Alliance) was able to achieve 50.2 percent, the Isidorian Unity Party on the other hand was able to hit 48.1 percent. This leaves 2.1 points separating the two, and shows Isabella Soler leading. There are 1.7 percent undecided voters. Over the last 19 polls, the average for New Democratic Alliance has been 59.0 points, whereas Unity Party has been averaging 40.0 points. Median results were 60.0 (Alliance) and 40.0 (IUP). Across all polls, the mean margin is 20.0, and the median 20.0 points. It is a neck and neck race, more than ever before. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n NDA leads Unity Party with 50.2 to 48.1 percent \n\nAccording to a poll from Friday, January 28. 2022, Isabella Soler (Alliance) was able to achieve 50.2 percent, the Isidorian Unity Party on the other hand was able to hit 48.1 percent. This produces a margin of 2.1 Points, with the Alliance in first place. There are 1.7 percent undecided voters. So far, the New Democratic Alliance averaged 59.0 points, while their opponents averaged 40.0 points over the last 19 polls. The median is 60.0 (NDA) and 40.0 (Unity Party) respectively. The mean margin for all polls is 20.0, the median margin 20.0. It is a neck and neck race, more than ever before. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 48.1 was on January 28. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 50.2 was on January 28. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The poll numbers decreased by -1.8 points for Isabella Soler. \n\nFollowing a poll from Friday, January 28. 2022, Isabella Soler (New Democratic Alliance) reached 50.2 percent, while Claudio López (Isidorian Unity Party) reached 48.1 percent. This leaves 2.1 points separating the two, and shows Isabella Soler leading. 1.7 percent of the voters have yet to decide. Over the last 19 polls, the average for New Democratic Alliance has been 59.0 points, whereas IUP has been averaging 40.0 points. Median results were 60.0 (NDA) and 40.0 (Isidorian Unity Party). Across all polls, the mean margin is 20.0, and the median 20.0 points. The difference between the two is rather small. A result this low has not been achieved so far by the New Democratic Alliance. The contestants are separated by a hair thin margin. The gap is getting tighter. The poll numbers decreased by -1.8 points for Isabella Soler. The result improves by 4.1 points for the Unity Party. The margin narrows by -5.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 50.2 was on January 28. 2022. The Unity Party's highest ever result, 48.1 was on January 28. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The IUP gains 4.1 percentage points. \n\nA poll from Friday, January 28. 2022 showed that Claudio López (IUP) reached 48.1 percent, while Isabella Soler (Alliance) reached 50.2 percent. This produces a margin of 2.1 Points, with the New Democratic Alliance in first place. So far, 1.7 percent of the voters have no preferred candidate. So far, the Isidorian Unity Party averaged 40.0 points, while their opponents averaged 59.0 points over the last 19 polls. The median is 40.0 (Unity Party) and 60.0(Alliance) respectively. The mean margin for all polls is 20.0, the median margin 20.0. This is a historically low result for the Alliance. A result this low has not been achieved so far by the Isidorian Unity Party. The margin is decreasing. The result improves by 4.1 points for the Unity Party. The New Democratic Alliance lost -1.8 percentage points. The Unity Party's highest ever result, 48.1 was on January 28. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 50.2 was on January 28. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. Alliance and Isidorian Unity Party are close together. The margin narrows by -5.9. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n The margin narrows by -5.9. \n\nA poll from Friday, January 28. 2022 showed that Claudio López (IUP) was able to achieve 48.1 percent, while Claudio López (Unity Party) reached 50.2 percent. This leaves 2.1 points separating the two. As of this date, 1.7 percent of the voters are undecided. The mean margin for all polls is 20.0, the median margin 20.0. This is a historically low result for the Alliance. The lead is shrinking. The Unity Party gains 4.1 percentage points. The poll numbers decreased by -1.8 points for Isabella Soler. The Isidorian Unity Party's highest ever result, 48.1 was on January 28. 2022. The NDA's lowest ever result, 50.2 was on January 28. 2022. NDA and Isidorian Unity Party are close together. The margin narrows by -5.9. At no date has the race been closer than January 28. 2022, when only 2.1 points separated the opponents.  \n \n Full Positive (NDA): \n \n Alliance leads Isidorian Unity Party with 52 to 44 percent \n\nThe latest poll from Thursday, January 27. 2022 showed that Isabella Soler (NDA) was able to achieve 52 percent, the Isidorian Unity Party on the other hand was able to hit 44 percent. This produces a margin of 8.0 Points, and shows Isabella Soler leading. As of this date, 4.0 percent of the voters are undecided. Over the last 18 polls, the average for NDA has been 60.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (New Democratic Alliance) and 40.0 (Unity Party). The mean margin for all polls is 21.0, the median margin 20.0. The contestants are separated by a hair thin margin. The NDA's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Half Positive (NDA) \n \n Isabella Soler in the Lead\n\nA poll from Thursday, January 27. 2022 showed that Isabella Soler (New Democratic Alliance) was able to achieve 52 percent, the Isidorian Unity Party on the other hand was able to hit 44 percent. This leaves 8.0 points separating the two, with the Alliance in first place. There are 4.0 percent undecided voters. Over the last 18 polls, the average for NDA has been 60.0 points, whereas Isidorian Unity Party has been averaging 39.0 points. Median results were 60.0 (NDA) and 40.0 (Unity Party). Across all polls, the mean margin is 21.0, and the median 20.0 points. The race has never been this close. The NDA's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 52.0 was on January 27. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The result improves by 1.6 points for the Unity Party. \n\nIn a poll conducted on Thursday, January 27. 2022, Isabella Soler (New Democratic Alliance) reached 52 percent, while Claudio López (Isidorian Unity Party) reached 44 percent. This produces a margin of 8.0 Points, and shows Isabella Soler leading. 4.0 percent of the voters have yet to decide. Over the last 18 polls, the average for New Democratic Alliance has been 60.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (Alliance) and 40.0 (IUP). The mean margin for all polls is 21.0, the median margin 20.0. A result this low has not been achieved so far by the NDA. It is a neck and neck race, more than ever before. The gap is getting smaller. The poll numbers decreased by -5.3 points for Isabella Soler. The Unity Party gains 1.6 percentage points. The margin narrows by -6.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 27. 2022, when only 8.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 52.0 was on January 27. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The result improves by 1.6 points for the Unity Party. \n\nAccording to a poll from Thursday, January 27. 2022, Claudio López (Isidorian Unity Party) reached 44 percent, while Isabella Soler (New Democratic Alliance) reached 52 percent. This produces a margin of 8.0 Points, with the NDA in first place. As of this date, 4.0 percent of the voters are undecided. Over the last 18 polls, the average for IUP has been 39.0 points, whereas New Democratic Alliance has been averaging 60.0 points. Median results were 40.0 (Unity Party) and 60.0 (New Democratic Alliance).  The mean margin for all polls is 21.0, the median margin 20.0. The points have hit rock bottom for the Alliance. A result this low has not been achieved so far by the IUP.  The Isidorian Unity Party is inching up to the NDA. The result improves by 1.6 points for the Unity Party. The poll numbers decreased by -5.3 points for Isabella Soler. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 52.0 was on January 27. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -6.9. At no date has the race been closer than January 27. 2022, when only 8.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The Isidorian Unity Party gains 1.6 percentage points. \n\nIn a poll conducted on Thursday, January 27. 2022, Claudio López (Isidorian Unity Party) was able to achieve 44 percent, while Claudio López (IUP) reached 52 percent. This produces a margin of 8.0 Points. So far, 4.0 percent of the voters have no preferred candidate. Across all polls, the mean margin is 21.0, and the median 20.0 points. This is a record low result for the New Democratic Alliance. The gap is getting smaller. The result improves by 1.6 points for the IUP. The poll numbers decreased by -5.3 points for Isabella Soler. The IUP's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 52.0 was on January 27. 2022. The margin narrows by -6.9. At no date has the race been closer than January 27. 2022, when only 8.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Alliance leads Isidorian Unity Party with 57.3 to 42.4 percent \n\nIn a poll conducted on Wednesday, January 26. 2022, Isabella Soler (NDA) reached 57.3 percent, the Isidorian Unity Party on the other hand was able to hit 42.4 percent. This leaves 14.9 points separating the two, and shows Isabella Soler in first place. So far, 0.3 percent of the voters have no preferred candidate. Over the last 17 polls, the average for NDA has been 60.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (NDA) and 39.0 (IUP). The mean margin for all polls is 21.0, the median margin 21.0. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n Alliance leads Unity Party with 57.3 to 42.4 percent \n\nThe latest poll from Wednesday, January 26. 2022 showed that Isabella Soler (NDA) reached 57.3 percent, the IUP on the other hand was able to hit 42.4 percent. This produces a margin of 14.9 Points, with the Alliance in first place. So far, 0.3 percent of the voters have no preferred candidate. Over the last 17 polls, the average for New Democratic Alliance has been 60.0 points, whereas IUP has been averaging 39.0 points. Median results were 60.0 (NDA) and 39.0 (Isidorian Unity Party). Across all polls, the mean margin is 21.0, and the median 21.0 points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  The Alliance lost -2.7 percentage points. \n\nIn a poll conducted on Wednesday, January 26. 2022, Isabella Soler (NDA) reached 57.3 percent, while Claudio López (IUP) reached 42.4 percent. This leaves 14.9 points separating the two, with the New Democratic Alliance in first place. 0.3 percent of the voters have yet to decide. So far, the Alliance averaged 60.0 points, while their opponents averaged 39.0 points over the last 17 polls. The median is 60.0 (New Democratic Alliance) and 39.0 (IUP) respectively. Across all polls, the mean margin is 21.0, and the median 21.0 points. The lead is shrinking. The poll numbers decreased by -2.7 points for Isabella Soler. The result improves by 3.2 points for the Isidorian Unity Party. The difference decreased by -5.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The margin narrows by -5.9. \n\nThe latest poll from Wednesday, January 26. 2022 showed that Claudio López (Isidorian Unity Party) reached 42.4 percent, while Isabella Soler (NDA) reached 57.3 percent. This produces a margin of 14.9 Points, and shows Isabella Soler in first place. As of this date, 0.3 percent of the voters are undecided. So far, the Unity Party averaged 39.0 points, while their opponents averaged 60.0 points over the last 17 polls. The median is 39.0 (Isidorian Unity Party) and 60.0(New Democratic Alliance) respectively. The mean margin for all polls is 21.0, the median margin 21.0. The lead is shrinking. The IUP gains 3.2 percentage points. The NDA lost -2.7 percentage points. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The margin narrows by -5.9. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The poll numbers decreased by -2.7 points for Isabella Soler. \n\nIn a poll conducted on Wednesday, January 26. 2022, Claudio López (Isidorian Unity Party) reached 42.4 percent, the NDA on the other hand was able to hit 57.3 percent. This leaves 14.9 points separating the two. 0.3 percent of the voters have yet to decide. Across all polls, the mean margin is 21.0, and the median 21.0 points. The gap is getting tighter. The IUP gains 3.2 percentage points. The NDA lost -2.7 percentage points. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The difference decreased by -5.9. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nThe latest poll from Tuesday, January 25. 2022 showed that Isabella Soler (Alliance) was able to achieve 60 percent, while Claudio López (Isidorian Unity Party) reached 39.2 percent. This leaves 20.8 points separating the two, with the NDA in first place. So far, 0.8 percent of the voters have no preferred candidate. Over the last 16 polls, the average for Alliance has been 61.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (Alliance) and 39.0 (Isidorian Unity Party). Across all polls, the mean margin is 22.0, and the median 21.0 points. The NDA's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a lot of catching up to do for IUP. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n New Democratic Alliance leads Unity Party with 60 to 39.2 percent \n\nFollowing a poll from Tuesday, January 25. 2022, Isabella Soler (NDA) reached 60 percent, while Claudio López (Unity Party) reached 39.2 percent. This produces a margin of 20.8 Points, and shows Isabella Soler in first place. As of this date, 0.8 percent of the voters are undecided. Over the last 16 polls, the average for Alliance has been 61.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (New Democratic Alliance) and 39.0 (Isidorian Unity Party). Across all polls, the mean margin is 22.0, and the median 21.0 points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. There is a lot of catching up to do for Isidorian Unity Party. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  New Democratic Alliance leads Isidorian Unity Party with 60 to 39.2 percent \n\nA poll from Tuesday, January 25. 2022 showed that Isabella Soler (Alliance) was able to achieve 60 percent, while Claudio López (Unity Party) reached 39.2 percent. This leaves 20.8 points separating the two, and shows Isabella Soler in first place. So far, 0.8 percent of the voters have no preferred candidate. So far, the NDA averaged 61.0 points, while their opponents averaged 39.0 points over the last 16 polls. The median is 60.0 (New Democratic Alliance) and 39.0 (IUP) respectively. The mean margin for all polls is 22.0, the median margin 21.0. There is a lot of catching up to do for Isidorian Unity Party. The lead is shrinking. The Alliance lost -4.0 percentage points. The result improves by 3.2 points for the Isidorian Unity Party. The margin narrows by -7.2. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The New Democratic Alliance lost -4.0 percentage points. \n\nIn a poll conducted on Tuesday, January 25. 2022, Claudio López (IUP) reached 39.2 percent, the NDA on the other hand was able to hit 60 percent. This leaves 20.8 points separating the two, with the New Democratic Alliance in first place. So far, 0.8 percent of the voters have no preferred candidate. Over the last 16 polls, the average for Unity Party has been 39.0 points, whereas Alliance has been averaging 61.0 points. Median results were 39.0 (Isidorian Unity Party) and 60.0 (NDA).  Across all polls, the mean margin is 22.0, and the median 21.0 points. The margin is decreasing. The result improves by 3.2 points for the Isidorian Unity Party. The poll numbers decreased by -4.0 points for Isabella Soler. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The margin narrows by -7.2. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The poll numbers decreased by -4.0 points for Isabella Soler. \n\nThe latest poll from Tuesday, January 25. 2022 showed that Claudio López (Isidorian Unity Party) was able to achieve 39.2 percent, the NDA on the other hand was able to hit 60 percent. This leaves 20.8 points separating the two. As of this date, 0.8 percent of the voters are undecided. Across all polls, the mean margin is 22.0, and the median 21.0 points. The margin is decreasing. The IUP gains 3.2 percentage points. The poll numbers decreased by -4.0 points for Isabella Soler. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The difference decreased by -7.2. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nAccording to a poll from Monday, January 24. 2022, Isabella Soler (NDA) was able to achieve 64 percent, while Claudio López (Unity Party) reached 36 percent. This leaves 28.0 points separating the two, with the NDA in first place. So far, 0.0 percent of the voters have no preferred candidate. Over the last 15 polls, the average for New Democratic Alliance has been 61.0 points, whereas IUP has been averaging 39.0 points. Median results were 60.0 (New Democratic Alliance) and 39.0 (Isidorian Unity Party). The mean margin for all polls is 22.0, the median margin 21.0. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a sizeable gap between the two. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Half Positive (NDA) \n \n NDA leads Unity Party with 64 to 36 percent \n\nA poll from Monday, January 24. 2022 showed that Isabella Soler (NDA) reached 64 percent, the Unity Party on the other hand was able to hit 36 percent. This produces a margin of 28.0 Points, and shows Isabella Soler in first place. So far, 0.0 percent of the voters have no preferred candidate. Over the last 15 polls, the average for NDA has been 61.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (New Democratic Alliance) and 39.0 (IUP). The mean margin for all polls is 22.0, the median margin 21.0. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. There is a lot of catching up to do for IUP. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  The Isidorian Unity Party gains 1.0 percentage points. \n\nIn a poll conducted on Monday, January 24. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 64 percent, the Unity Party on the other hand was able to hit 36 percent. This produces a margin of 28.0 Points, and shows Isabella Soler in first place. As of this date, 0.0 percent of the voters are undecided. So far, the NDA averaged 61.0 points, while their opponents averaged 39.0 points over the last 15 polls. The median is 60.0 (New Democratic Alliance) and 39.0 (Isidorian Unity Party) respectively. Across all polls, the mean margin is 22.0, and the median 21.0 points. There is a lot of catching up to do for IUP. The lead is shrinking. The New Democratic Alliance lost -0.5 percentage points. The Isidorian Unity Party gains 1.0 percentage points. The difference decreased by -1.5. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Isidorian Unity Party scores 36, NDA 64 percent.\n\nFollowing a poll from Monday, January 24. 2022, Claudio López (IUP) was able to achieve 36 percent, while Isabella Soler (Alliance) reached 64 percent. This leaves 28.0 points separating the two, with the Alliance in first place. 0.0 percent of the voters have yet to decide. Over the last 15 polls, the average for IUP has been 39.0 points, whereas NDA has been averaging 61.0 points. Median results were 39.0 (Isidorian Unity Party) and 60.0 (Alliance).  Across all polls, the mean margin is 22.0, and the median 21.0 points. The gap is getting tighter. The IUP gains 1.0 percentage points. The poll numbers decreased by -0.5 points for Isabella Soler. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The margin narrows by -1.5. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The result improves by 1.0 points for the Unity Party. \n\nFollowing a poll from Monday, January 24. 2022, Claudio López (Isidorian Unity Party) was able to achieve 36 percent, the New Democratic Alliance on the other hand was able to hit 64 percent. This leaves 28.0 points separating the two. As of this date, 0.0 percent of the voters are undecided. The mean margin for all polls is 22.0, the median margin 21.0. The lead is shrinking. The result improves by 1.0 points for the Unity Party. The Alliance lost -0.5 percentage points. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The margin narrows by -1.5. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Alliance leads Unity Party with 64.5 to 35 percent \n\nThe latest poll from Sunday, January 23. 2022 showed that Isabella Soler (Alliance) was able to achieve 64.5 percent, the Unity Party on the other hand was able to hit 35 percent. This leaves 29.5 points separating the two, with the New Democratic Alliance in first place. So far, 0.5 percent of the voters have no preferred candidate. Over the last 14 polls, the average for NDA has been 60.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (NDA) and 40.0 (Isidorian Unity Party). Across all polls, the mean margin is 22.0, and the median 20.0 points. The NDA's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a sizeable gap between the two. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Half Positive (NDA) \n \n New Democratic Alliance leads Unity Party with 64.5 to 35 percent \n\nIn a poll conducted on Sunday, January 23. 2022, Isabella Soler (Alliance) was able to achieve 64.5 percent, while Claudio López (IUP) reached 35 percent. This leaves 29.5 points separating the two, with the NDA in first place. As of this date, 0.5 percent of the voters are undecided. So far, the Alliance averaged 60.0 points, while their opponents averaged 39.0 points over the last 14 polls. The median is 60.0 (New Democratic Alliance) and 40.0 (IUP) respectively. Across all polls, the mean margin is 22.0, and the median 20.0 points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. There is a sizeable gap between the two. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  Alliance leads Unity Party with 64.5 to 35 percent \n\nAccording to a poll from Sunday, January 23. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 64.5 percent, the Isidorian Unity Party on the other hand was able to hit 35 percent. This produces a margin of 29.5 Points, and shows Isabella Soler in first place. There are 0.5 percent undecided voters. Over the last 14 polls, the average for Alliance has been 60.0 points, whereas Isidorian Unity Party has been averaging 39.0 points. Median results were 60.0 (NDA) and 40.0 (IUP). The mean margin for all polls is 22.0, the median margin 20.0. Alliance leads IUP by a large margin.  The IUP is inching up to the Alliance. The NDA lost -1.5 percentage points. The Unity Party gains 1.0 percentage points. The difference decreased by -2.5. The Alliance had a local high point in the previous poll at 66.0, and is now sinking. The IUP had a low point in the previous poll at 34.0, but is now improving again. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022. The NDA's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n The difference decreased by -2.5. \n\nA poll from Sunday, January 23. 2022 showed that Claudio López (IUP) reached 35 percent, while Isabella Soler (New Democratic Alliance) reached 64.5 percent. This produces a margin of 29.5 Points, and shows Isabella Soler leading. As of this date, 0.5 percent of the voters are undecided. Over the last 14 polls, the average for IUP has been 39.0 points, whereas NDA has been averaging 60.0 points. Median results were 40.0 (Isidorian Unity Party) and 60.0 (NDA).  Across all polls, the mean margin is 22.0, and the median 20.0 points. The lead is shrinking. The result improves by 1.0 points for the Unity Party. The New Democratic Alliance lost -1.5 percentage points. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -2.5. After hitting a local high point, New Democratic Alliance's results are now decreasing. The Unity Party had a low point in the previous poll at 34.0, but is now improving again. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 22. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 35, New Democratic Alliance 64.5 percent.\n\nA poll from Sunday, January 23. 2022 showed that Claudio López (Unity Party) was able to achieve 35 percent, while Claudio López (Isidorian Unity Party) reached 64.5 percent. This produces a margin of 29.5 Points. There are 0.5 percent undecided voters. Across all polls, the mean margin is 22.0, and the median 20.0 points. The gap is getting tighter. The result improves by 1.0 points for the Isidorian Unity Party. The New Democratic Alliance lost -1.5 percentage points. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The difference decreased by -2.5. The New Democratic Alliance had a local high point in the previous poll at 66.0, and is now sinking. The Unity Party had a low point in the previous poll at 34.0, but is now improving again. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The result improves by 1.0 points for the Alliance. \n\nThe latest poll from Saturday, January 22. 2022 showed that Isabella Soler (New Democratic Alliance) reached 66 percent, while Claudio López (IUP) reached 34 percent. This leaves 32.0 points separating the two, and shows Isabella Soler leading. 0.0 percent of the voters have yet to decide. So far, the Alliance averaged 60.0 points, while their opponents averaged 39.0 points over the last 13 polls. The median is 60.0 (NDA) and 40.0 (Isidorian Unity Party) respectively. Across all polls, the mean margin is 21.0, and the median 20.0 points. Up until this point, there is no higher result for the Alliance. The lead is getting bigger. The result improves by 1.0 points for the Alliance. The Isidorian Unity Party lost -0.5 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. This is the highest result so far. Alliance leads IUP by a large margin. The margin widens by 1.5. The NDA had a local low point in the previous poll at 65.0, and is now rising. The IUP had a local peak in the previous poll at 34.5, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n The difference increased by 1.5. \n\nIn a poll conducted on Saturday, January 22. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 66 percent, the Isidorian Unity Party on the other hand was able to hit 34 percent. This leaves 32.0 points separating the two, with the New Democratic Alliance in first place. As of this date, 0.0 percent of the voters are undecided. Over the last 13 polls, the average for Alliance has been 60.0 points, whereas IUP has been averaging 39.0 points. Median results were 60.0 (New Democratic Alliance) and 40.0 (Unity Party). Across all polls, the mean margin is 21.0, and the median 20.0 points. This is the highest result so far for the Alliance. Up until this point, there is no higher result for the Isidorian Unity Party. The lead is getting bigger. The result improves by 1.0 points for the Alliance. The Unity Party lost -0.5 percentage points. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. This is the highest result so far. There is a sizeable gap between the two. The margin widens by 1.5. The New Democratic Alliance had a local low point in the previous poll at 65.0, and is now rising. The Unity Party had a local peak in the previous poll at 34.5, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  The poll numbers decreased by -0.5 points for Claudio López. \n\nIn a poll conducted on Saturday, January 22. 2022, Isabella Soler (Alliance) was able to achieve 66 percent, the Isidorian Unity Party on the other hand was able to hit 34 percent. This leaves 32.0 points separating the two, and shows Isabella Soler in first place. So far, 0.0 percent of the voters have no preferred candidate. Over the last 13 polls, the average for New Democratic Alliance has been 60.0 points, whereas Unity Party has been averaging 39.0 points. Median results were 60.0 (Alliance) and 40.0 (Isidorian Unity Party). The mean margin for all polls is 21.0, the median margin 20.0. Up until this point, there is no higher result. New Democratic Alliance leads IUP by a large margin. Up until this point, there is no higher result for the New Democratic Alliance. This marks the second biggest difference. The lead is getting bigger. The result improves by 1.0 points for the NDA. The Isidorian Unity Party lost -0.5 percentage points. The margin widens by 1.5. The New Democratic Alliance had a local low point in the previous poll at 65.0, and is now rising. The Unity Party had a local peak in the previous poll at 34.5, and is now sinking. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Up until this point, there is no higher result. \n\nIn a poll conducted on Saturday, January 22. 2022, Claudio López (Unity Party) reached 34 percent, while Isabella Soler (Alliance) reached 66 percent. This leaves 32.0 points separating the two, and shows Isabella Soler in first place. So far, 0.0 percent of the voters have no preferred candidate. So far, the Unity Party averaged 39.0 points, while their opponents averaged 60.0 points over the last 13 polls. The median is 40.0 (Unity Party) and 60.0(Alliance) respectively. The mean margin for all polls is 21.0, the median margin 20.0. It is almost the largest distance in results between the two. The lead is getting bigger. The IUP's highest ever result, 45.0 was on January 13. 2022. The Alliance's highest ever result, 66.0 was on January 22. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. Up until this point, there is no higher result. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 22. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n IUP scores 34, New Democratic Alliance 66 percent.\n\nAccording to a poll from Saturday, January 22. 2022, Claudio López (IUP) reached 34 percent, the New Democratic Alliance on the other hand was able to hit 66 percent. This produces a margin of 32.0 Points. As of this date, 0.0 percent of the voters are undecided. Across all polls, the mean margin is 21.0, and the median 20.0 points. This marks the second biggest difference. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nIn a poll conducted on Friday, January 21. 2022, Isabella Soler (NDA) reached 65 percent, the Isidorian Unity Party on the other hand was able to hit 34.5 percent. This produces a margin of 30.5 Points, with the Alliance in first place. As of this date, 0.5 percent of the voters are undecided. So far, the Alliance averaged 60.0 points, while their opponents averaged 40.0 points over the last 12 polls. The median is 59.0 (NDA) and 40.0 (IUP) respectively. Across all polls, the mean margin is 20.0, and the median 19.0 points. This is the second highest result for this poll. The Alliance's highest ever result, 66.0 was on January 20. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. There is a lot of catching up to do for Unity Party. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 20. 2022. The lowest result to date, 32.3 was set by the Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n Isabella Soler in the Lead\n\nA poll from Friday, January 21. 2022 showed that Isabella Soler (NDA) was able to achieve 65 percent, while Claudio López (Unity Party) reached 34.5 percent. This leaves 30.5 points separating the two, and shows Isabella Soler leading. 0.5 percent of the voters have yet to decide. Over the last 12 polls, the average for Alliance has been 60.0 points, whereas IUP has been averaging 40.0 points. Median results were 59.0 (New Democratic Alliance) and 40.0 (IUP). Across all polls, the mean margin is 20.0, and the median 19.0 points. It is almost the best result (so far). The Alliance's highest ever result, 66.0 was on January 20. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. There is a lot of catching up to do for Isidorian Unity Party. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 20. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Neutral (NDA) \n \n  The result improves by 2.2 points for the Unity Party. \n\nIn a poll conducted on Friday, January 21. 2022, Isabella Soler (New Democratic Alliance) reached 65 percent, the Unity Party on the other hand was able to hit 34.5 percent. This leaves 30.5 points separating the two, with the NDA in first place. There are 0.5 percent undecided voters. So far, the NDA averaged 60.0 points, while their opponents averaged 40.0 points over the last 12 polls. The median is 59.0 (Alliance) and 40.0 (Unity Party) respectively. Across all polls, the mean margin is 20.0, and the median 19.0 points. NDA leads Isidorian Unity Party by a large margin. It is almost the best result (so far). It is almost the largest distance in results between the two. The Isidorian Unity Party is catching up. The New Democratic Alliance lost -1.0 percentage points. The Isidorian Unity Party gains 2.2 percentage points. The difference decreased by -3.2. The NDA had a local high point in the previous poll at 66.0, and is now sinking. The IUP had a low point in the previous poll at 32.3, but is now improving again. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 20. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The Alliance's highest ever result, 66.0 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n IUP scores 34.5, Alliance 65 percent.\n\nThe latest poll from Friday, January 21. 2022 showed that Claudio López (Isidorian Unity Party) was able to achieve 34.5 percent, the Alliance on the other hand was able to hit 65 percent. This leaves 30.5 points separating the two, and shows Isabella Soler leading. So far, 0.5 percent of the voters have no preferred candidate. So far, the Unity Party averaged 40.0 points, while their opponents averaged 60.0 points over the last 12 polls. The median is 40.0 (Isidorian Unity Party) and 59.0(NDA) respectively. Across all polls, the mean margin is 20.0, and the median 19.0 points. This marks the second biggest difference. The gap is getting tighter. The result improves by 2.2 points for the Isidorian Unity Party. The New Democratic Alliance lost -1.0 percentage points. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 66.0 was on January 20. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The difference decreased by -3.2. The New Democratic Alliance had a local high point in the previous poll at 66.0, and is now sinking. The IUP had a low point in the previous poll at 32.3, but is now improving again. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the NDA on January 20. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Full negative (NDA) \n \n The result improves by 2.2 points for the Isidorian Unity Party. \n\nIn a poll conducted on Friday, January 21. 2022, Claudio López (Unity Party) reached 34.5 percent, while Claudio López (Isidorian Unity Party) reached 65 percent. This produces a margin of 30.5 Points. There are 0.5 percent undecided voters. The mean margin for all polls is 20.0, the median margin 19.0. It is almost the largest distance in results between the two. The margin is decreasing. The result improves by 2.2 points for the Isidorian Unity Party. The poll numbers decreased by -1.0 points for Isabella Soler. The IUP's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The difference decreased by -3.2. The New Democratic Alliance had a local high point in the previous poll at 66.0, and is now sinking. The Unity Party had a low point in the previous poll at 32.3, but is now improving again. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The result improves by 4.0 points for the Alliance. \n\nThe latest poll from Thursday, January 20. 2022 showed that Isabella Soler (New Democratic Alliance) reached 66 percent, while Claudio López (IUP) reached 32.3 percent. This produces a margin of 33.7 Points, with the New Democratic Alliance in first place. 1.7 percent of the voters have yet to decide. So far, the New Democratic Alliance averaged 59.0 points, while their opponents averaged 40.0 points over the last 11 polls. The median is 58.0 (New Democratic Alliance) and 41.0 (Unity Party) respectively. Across all polls, the mean margin is 19.0, and the median 18.0 points. Up until this point, there is no higher result for the NDA. The New Democratic Alliance are widening the gap. The result improves by 4.0 points for the Alliance. The IUP lost -3.9 percentage points. The NDA's highest ever result, 66.0 was on January 20. 2022. The Unity Party's lowest ever result, 32.3 was on January 20. 2022. This is the highest result so far. There is a sizeable gap between the two. The margin widens by 7.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the Alliance on January 20. 2022. The lowest result to date, 32.3 was set by the Isidorian Unity Party on January 20. 2022.  \n \n Half Positive (NDA) \n \n This is the highest result so far. \n\nFollowing a poll from Thursday, January 20. 2022, Isabella Soler (NDA) was able to achieve 66 percent, while Claudio López (IUP) reached 32.3 percent. This produces a margin of 33.7 Points, and shows Isabella Soler leading. As of this date, 1.7 percent of the voters are undecided. So far, the NDA averaged 59.0 points, while their opponents averaged 40.0 points over the last 11 polls. The median is 58.0 (New Democratic Alliance) and 41.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 19.0, the median margin 18.0. This is the highest result so far for the Alliance. Up until this point, there is no higher result for the Unity Party. The NDA are widening the gap. The result improves by 4.0 points for the Alliance. The Isidorian Unity Party lost -3.9 percentage points. The Alliance's highest ever result, 66.0 was on January 20. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 32.3 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. This is the highest result so far. There is a sizeable gap between the two. The margin widens by 7.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. The highest result so far, 66.0 was achieved by the NDA on January 20. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Neutral (NDA) \n \n  New Democratic Alliance leads Isidorian Unity Party with 66 to 32.3 percent \n\nA poll from Thursday, January 20. 2022 showed that Isabella Soler (NDA) was able to achieve 66 percent, the IUP on the other hand was able to hit 32.3 percent. This leaves 33.7 points separating the two, with the NDA in first place. There are 1.7 percent undecided voters. So far, the New Democratic Alliance averaged 59.0 points, while their opponents averaged 40.0 points over the last 11 polls. The median is 58.0 (Alliance) and 41.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 19.0, the median margin 18.0. Up until this point, there is no higher result. NDA leads IUP by a large margin. This is the highest result so far for the NDA. The lead has never been clearer for NDA.The NDA are widening the gap. The result improves by 4.0 points for the New Democratic Alliance. The IUP lost -3.9 percentage points. The difference increased by 7.9. So far, the divide was never larger than on January 20. 2022 with 33.7 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the New Democratic Alliance on January 20. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022. The Alliance's highest ever result, 66.0 was on January 20. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022.  \n \n Half Negative (NDA) \n \n Up until this point, there is no higher result. \n\nFollowing a poll from Thursday, January 20. 2022, Claudio López (IUP) reached 32.3 percent, the Alliance on the other hand was able to hit 66 percent. This produces a margin of 33.7 Points, and shows Isabella Soler leading. 1.7 percent of the voters have yet to decide. So far, the IUP averaged 40.0 points, while their opponents averaged 59.0 points over the last 11 polls. The median is 41.0 (IUP) and 58.0(NDA) respectively. The mean margin for all polls is 19.0, the median margin 18.0. It is the largest margin between results so far. The lead is increasing. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's highest ever result, 66.0 was on January 20. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 32.3 was on January 20. 2022. This is the highest result so far. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 66.0 was achieved by the Alliance on January 20. 2022. The lowest result to date, 32.3 was set by the IUP on January 20. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 32.3, Alliance 66 percent.\n\nThe latest poll from Thursday, January 20. 2022 showed that Claudio López (Unity Party) was able to achieve 32.3 percent, while Claudio López (Isidorian Unity Party) reached 66 percent. This leaves 33.7 points separating the two. As of this date, 1.7 percent of the voters are undecided. The mean margin for all polls is 19.0, the median margin 18.0. The lead has never been clearer for NDA.The IUP's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The difference increased by 1.8. \n\nIn a poll conducted on Wednesday, January 19. 2022, Isabella Soler (New Democratic Alliance) reached 62 percent, the Isidorian Unity Party on the other hand was able to hit 36.2 percent. This produces a margin of 25.8 Points, and shows Isabella Soler leading. There are 1.8 percent undecided voters. Over the last 10 polls, the average for New Democratic Alliance has been 58.0 points, whereas IUP has been averaging 41.0 points. Median results were 58.0 (NDA) and 41.0 (IUP). Across all polls, the mean margin is 18.0, and the median 17.0 points. This is the highest result so far for the NDA. The lead is increasing. The IUP lost -1.8 percentage points. The Alliance's highest ever result, 62.0 was on January 19. 2022. The Unity Party's lowest ever result, 36.2 was on January 19. 2022. This is the highest result so far. New Democratic Alliance leads Unity Party by a large margin. The difference increased by 1.8. So far, the divide was never larger than on January 19. 2022 with 25.8 points between both. The highest result so far, 62.0 was achieved by the NDA on January 19. 2022. The lowest result to date, 36.2 was set by the Isidorian Unity Party on January 19. 2022.  \n \n Half Positive (NDA) \n \n New Democratic Alliance leads Isidorian Unity Party with 62 to 36.2 percent \n\nA poll from Wednesday, January 19. 2022 showed that Isabella Soler (Alliance) reached 62 percent, while Claudio López (Unity Party) reached 36.2 percent. This leaves 25.8 points separating the two, and shows Isabella Soler leading. So far, 1.8 percent of the voters have no preferred candidate. So far, the NDA averaged 58.0 points, while their opponents averaged 41.0 points over the last 10 polls. The median is 58.0 (NDA) and 41.0 (IUP) respectively. Across all polls, the mean margin is 18.0, and the median 17.0 points. Up until this point, there is no higher result for the NDA. This is the highest result so far for the Isidorian Unity Party. The lead is increasing. The Isidorian Unity Party lost -1.8 percentage points. The NDA's highest ever result, 62.0 was on January 19. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 36.2 was on January 19. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. This is the highest result so far. NDA leads Isidorian Unity Party by a large margin. The margin widens by 1.8. So far, the divide was never larger than on January 19. 2022 with 25.8 points between both. The highest result so far, 62.0 was achieved by the New Democratic Alliance on January 19. 2022. The lowest result to date, 36.2 was set by the Isidorian Unity Party on January 19. 2022.  \n \n Neutral (NDA) \n \n  Alliance leads Isidorian Unity Party with 62 to 36.2 percent \n\nThe latest poll from Wednesday, January 19. 2022 showed that Isabella Soler (New Democratic Alliance) was able to achieve 62 percent, the IUP on the other hand was able to hit 36.2 percent. This leaves 25.8 points separating the two, with the NDA in first place. There are 1.8 percent undecided voters. So far, the Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 10 polls. The median is 58.0 (New Democratic Alliance) and 41.0 (Unity Party) respectively. The mean margin for all polls is 18.0, the median margin 17.0. This is the highest result so far. There is a sizeable gap between the two. Up until this point, there is no higher result for the NDA. The difference has never been more obvious.  The NDA are climbing away. The IUP lost -1.8 percentage points. The margin widens by 1.8. So far, the divide was never larger than on January 19. 2022 with 25.8 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 62.0 was achieved by the Alliance on January 19. 2022. The lowest result to date, 36.2 was set by the Isidorian Unity Party on January 19. 2022. The New Democratic Alliance's highest ever result, 62.0 was on January 19. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 36.2 was on January 19. 2022.  \n \n Half Negative (NDA) \n \n This is the highest result so far. \n\nFollowing a poll from Wednesday, January 19. 2022, Claudio López (Unity Party) was able to achieve 36.2 percent, the NDA on the other hand was able to hit 62 percent. This produces a margin of 25.8 Points, with the NDA in first place. As of this date, 1.8 percent of the voters are undecided. So far, the Isidorian Unity Party averaged 41.0 points, while their opponents averaged 58.0 points over the last 10 polls. The median is 41.0 (Isidorian Unity Party) and 58.0(NDA) respectively. The mean margin for all polls is 18.0, the median margin 17.0. It is the largest margin between results so far.  The NDA are climbing away. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 62.0 was on January 19. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 36.2 was on January 19. 2022. Up until this point, there is no higher result. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 62.0 was achieved by the New Democratic Alliance on January 19. 2022. The lowest result to date, 36.2 was set by the Unity Party on January 19. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 36.2, Alliance 62 percent.\n\nIn a poll conducted on Wednesday, January 19. 2022, Claudio López (IUP) reached 36.2 percent, while Claudio López (Isidorian Unity Party) reached 62 percent. This leaves 25.8 points separating the two. So far, 1.8 percent of the voters have no preferred candidate. Across all polls, the mean margin is 18.0, and the median 17.0 points. It is the largest margin between results so far. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The difference increased by 3.2. \n\nIn a poll conducted on Tuesday, January 18. 2022, Isabella Soler (NDA) reached 62 percent, while Claudio López (IUP) reached 38 percent. This produces a margin of 24.0 Points, with the New Democratic Alliance in first place. So far, 0.0 percent of the voters have no preferred candidate. So far, the New Democratic Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 9 polls. The median is 58.0 (Alliance) and 41.0 (Isidorian Unity Party) respectively. Across all polls, the mean margin is 17.0, and the median 16.0 points. Up until this point, there is no higher result for the New Democratic Alliance. The lead is getting bigger. The result improves by 2.0 points for the Alliance. The Unity Party lost -1.2 percentage points. The Alliance's highest ever result, 62.0 was on January 18. 2022. The IUP's lowest ever result, 38.0 was on January 18. 2022. This is the highest result so far. There is a lot of catching up to do for IUP. The margin widens by 3.2. So far, the divide was never larger than on January 18. 2022 with 24.0 points between both. The highest result so far, 62.0 was achieved by the NDA on January 18. 2022. The lowest result to date, 38.0 was set by the IUP on January 18. 2022.  \n \n Half Positive (NDA) \n \n This is the highest result so far. \n\nThe latest poll from Tuesday, January 18. 2022 showed that Isabella Soler (Alliance) was able to achieve 62 percent, the IUP on the other hand was able to hit 38 percent. This produces a margin of 24.0 Points, and shows Isabella Soler in first place. As of this date, 0.0 percent of the voters are undecided. Over the last 9 polls, the average for NDA has been 58.0 points, whereas Unity Party has been averaging 41.0 points. Median results were 58.0 (Alliance) and 41.0 (Isidorian Unity Party). The mean margin for all polls is 17.0, the median margin 16.0. Up until this point, there is no higher result for the NDA. Up until this point, there is no higher result for the Unity Party.  The New Democratic Alliance are climbing away. The result improves by 2.0 points for the NDA. The poll numbers decreased by -1.2 points for Claudio López. The Alliance's highest ever result, 62.0 was on January 18. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 38.0 was on January 18. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. This is the highest result so far. There is a lot of catching up to do for IUP. The margin widens by 3.2. So far, the divide was never larger than on January 18. 2022 with 24.0 points between both. The highest result so far, 62.0 was achieved by the NDA on January 18. 2022. The lowest result to date, 38.0 was set by the Unity Party on January 18. 2022.  \n \n Neutral (NDA) \n \n  Up until this point, there is no higher result. \n\nFollowing a poll from Tuesday, January 18. 2022, Isabella Soler (New Democratic Alliance) was able to achieve 62 percent, the IUP on the other hand was able to hit 38 percent. This leaves 24.0 points separating the two, and shows Isabella Soler in first place. There are 0.0 percent undecided voters. So far, the New Democratic Alliance averaged 58.0 points, while their opponents averaged 41.0 points over the last 9 polls. The median is 58.0 (NDA) and 41.0 (IUP) respectively. The mean margin for all polls is 17.0, the median margin 16.0. This is the highest result so far. NDA leads IUP by a large margin. Up until this point, there is no higher result for the New Democratic Alliance. The difference has never been more obvious. The lead is increasing. The Alliance gains 2.0 percentage points. The Isidorian Unity Party lost -1.2 percentage points. The difference increased by 3.2. So far, the divide was never larger than on January 18. 2022 with 24.0 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 62.0 was achieved by the Alliance on January 18. 2022. The lowest result to date, 38.0 was set by the Unity Party on January 18. 2022. The Alliance's highest ever result, 62.0 was on January 18. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 38.0 was on January 18. 2022.  \n \n Half Negative (NDA) \n \n Up until this point, there is no higher result. \n\nA poll from Tuesday, January 18. 2022 showed that Claudio López (Isidorian Unity Party) was able to achieve 38 percent, while Isabella Soler (New Democratic Alliance) reached 62 percent. This leaves 24.0 points separating the two, and shows Isabella Soler in first place. As of this date, 0.0 percent of the voters are undecided. So far, the IUP averaged 41.0 points, while their opponents averaged 58.0 points over the last 9 polls. The median is 41.0 (Unity Party) and 58.0(New Democratic Alliance) respectively. The mean margin for all polls is 17.0, the median margin 16.0. The difference has never been more obvious. The lead is increasing. The IUP's highest ever result, 45.0 was on January 13. 2022. The NDA's highest ever result, 62.0 was on January 18. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 38.0 was on January 18. 2022. Up until this point, there is no higher result. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 62.0 was achieved by the Alliance on January 18. 2022. The lowest result to date, 38.0 was set by the Unity Party on January 18. 2022.  \n \n Full negative (NDA) \n \n Unity Party scores 38, New Democratic Alliance 62 percent.\n\nFollowing a poll from Tuesday, January 18. 2022, Claudio López (Unity Party) reached 38 percent, while Claudio López (Isidorian Unity Party) reached 62 percent. This leaves 24.0 points separating the two. 0.0 percent of the voters have yet to decide. Across all polls, the mean margin is 17.0, and the median 16.0 points. The difference has never been more evident. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The difference increased by 4.5. \n\nThe latest poll from Monday, January 17. 2022 showed that Isabella Soler (New Democratic Alliance) reached 60 percent, while Claudio López (Unity Party) reached 39.2 percent. This produces a margin of 20.8 Points, with the New Democratic Alliance in first place. 0.8 percent of the voters have yet to decide. So far, the Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 8 polls. The median is 57.0 (New Democratic Alliance) and 42.0 (Unity Party) respectively. The mean margin for all polls is 16.0, the median margin 16.0. This is the highest result so far for the New Democratic Alliance. The lead is getting bigger. The NDA gains 2.5 percentage points. The poll numbers decreased by -2.0 points for Claudio López. The NDA's highest ever result, 60.0 was on January 17. 2022. The Isidorian Unity Party's lowest ever result, 39.2 was on January 17. 2022. Up until this point, there is no higher result. There is a lot of catching up to do for IUP. The difference increased by 4.5. So far, the divide was never larger than on January 17. 2022 with 20.8 points between both. The highest result so far, 60.0 was achieved by the Alliance on January 17. 2022. The lowest result to date, 39.2 was set by the Isidorian Unity Party on January 17. 2022.  \n \n Half Positive (NDA) \n \n The margin widens by 4.5. \n\nThe latest poll from Monday, January 17. 2022 showed that Isabella Soler (Alliance) was able to achieve 60 percent, the Isidorian Unity Party on the other hand was able to hit 39.2 percent. This produces a margin of 20.8 Points, and shows Isabella Soler in first place. So far, 0.8 percent of the voters have no preferred candidate. Over the last 8 polls, the average for New Democratic Alliance has been 57.0 points, whereas IUP has been averaging 42.0 points. Median results were 57.0 (NDA) and 42.0 (Unity Party). Across all polls, the mean margin is 16.0, and the median 16.0 points. Up until this point, there is no higher result for the Alliance. This is the highest result so far for the Unity Party. The New Democratic Alliance are widening the gap. The Alliance gains 2.5 percentage points. The IUP lost -2.0 percentage points. The NDA's highest ever result, 60.0 was on January 17. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 39.2 was on January 17. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. This is the highest result so far. There is a lot of catching up to do for Isidorian Unity Party. The difference increased by 4.5. So far, the divide was never larger than on January 17. 2022 with 20.8 points between both. The highest result so far, 60.0 was achieved by the New Democratic Alliance on January 17. 2022. The lowest result to date, 39.2 was set by the Unity Party on January 17. 2022.  \n \n Neutral (NDA) \n \n  The poll numbers decreased by -2.0 points for Claudio López. \n\nFollowing a poll from Monday, January 17. 2022, Isabella Soler (NDA) reached 60 percent, the IUP on the other hand was able to hit 39.2 percent. This produces a margin of 20.8 Points, with the New Democratic Alliance in first place. There are 0.8 percent undecided voters. So far, the NDA averaged 57.0 points, while their opponents averaged 42.0 points over the last 8 polls. The median is 57.0 (New Democratic Alliance) and 42.0 (IUP) respectively. The mean margin for all polls is 16.0, the median margin 16.0. This is the highest result so far. There is a sizeable gap between the two. This is the highest result so far for the New Democratic Alliance. The difference has never been more on display. The lead is increasing. The result improves by 2.5 points for the NDA. The poll numbers decreased by -2.0 points for Claudio López. The difference increased by 4.5. So far, the divide was never larger than on January 17. 2022 with 20.8 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the NDA on January 17. 2022. The lowest result to date, 39.2 was set by the Isidorian Unity Party on January 17. 2022. The NDA's highest ever result, 60.0 was on January 17. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 39.2 was on January 17. 2022.  \n \n Half Negative (NDA) \n \n This is the highest result so far. \n\nThe latest poll from Monday, January 17. 2022 showed that Claudio López (Unity Party) was able to achieve 39.2 percent, the Alliance on the other hand was able to hit 60 percent. This produces a margin of 20.8 Points, and shows Isabella Soler in first place. There are 0.8 percent undecided voters. Over the last 8 polls, the average for IUP has been 42.0 points, whereas Alliance has been averaging 57.0 points. Median results were 42.0 (Unity Party) and 57.0 (Alliance).  The mean margin for all polls is 16.0, the median margin 16.0. The difference has never been more on display. The New Democratic Alliance are widening the gap. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's highest ever result, 60.0 was on January 17. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 39.2 was on January 17. 2022. This is the highest result so far. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the NDA on January 17. 2022. The lowest result to date, 39.2 was set by the Unity Party on January 17. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 39.2, Alliance 60 percent.\n\nIn a poll conducted on Monday, January 17. 2022, Claudio López (Isidorian Unity Party) reached 39.2 percent, while Claudio López (Unity Party) reached 60 percent. This leaves 20.8 points separating the two. 0.8 percent of the voters have yet to decide. Across all polls, the mean margin is 16.0, and the median 16.0 points. The difference has never been more evident. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Alliance leads Unity Party with 57.5 to 41.2 percent \n\nAccording to a poll from Sunday, January 16. 2022, Isabella Soler (New Democratic Alliance) reached 57.5 percent, the Isidorian Unity Party on the other hand was able to hit 41.2 percent. This produces a margin of 16.3 Points, and shows Isabella Soler leading. There are 1.3 percent undecided voters. Over the last 7 polls, the average for Alliance has been 57.0 points, whereas Isidorian Unity Party has been averaging 42.0 points. Median results were 57.0 (New Democratic Alliance) and 42.0 (Unity Party). Across all polls, the mean margin is 15.0, and the median 15.0 points. The lead is increasing. The result improves by 0.5 points for the New Democratic Alliance. The Unity Party lost -1.0 percentage points. The Alliance's highest ever result, 60.0 was on January 10. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022. NDA leads IUP by a large margin. The margin widens by 1.5. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the NDA on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022.  \n \n Half Positive (NDA) \n \n Isabella Soler in the Lead\n\nThe latest poll from Sunday, January 16. 2022 showed that Isabella Soler (Alliance) was able to achieve 57.5 percent, while Claudio López (Unity Party) reached 41.2 percent. This leaves 16.3 points separating the two, and shows Isabella Soler leading. As of this date, 1.3 percent of the voters are undecided. So far, the New Democratic Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 7 polls. The median is 57.0 (NDA) and 42.0 (Isidorian Unity Party) respectively. Across all polls, the mean margin is 15.0, and the median 15.0 points. The lead is getting bigger. The result improves by 0.5 points for the New Democratic Alliance. The Unity Party lost -1.0 percentage points. The Alliance's highest ever result, 60.0 was on January 10. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 40.0 was on January 10. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. NDA leads Unity Party by a large margin. The margin widens by 1.5. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the IUP on January 10. 2022.  \n \n Neutral (NDA) \n \n  Isabella Soler in the Lead\n\nIn a poll conducted on Sunday, January 16. 2022, Isabella Soler (Alliance) was able to achieve 57.5 percent, while Claudio López (Isidorian Unity Party) reached 41.2 percent. This leaves 16.3 points separating the two, and shows Isabella Soler leading. 1.3 percent of the voters have yet to decide. So far, the NDA averaged 57.0 points, while their opponents averaged 42.0 points over the last 7 polls. The median is 57.0 (Alliance) and 42.0 (Isidorian Unity Party) respectively. Across all polls, the mean margin is 15.0, and the median 15.0 points. NDA leads IUP by a large margin. The NDA are widening the gap. The result improves by 0.5 points for the NDA. The poll numbers decreased by -1.0 points for Claudio López. The margin widens by 1.5. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the IUP on January 10. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 40.0 was on January 10. 2022.  \n \n Half Negative (NDA) \n \n Unity Party scores 41.2, New Democratic Alliance 57.5 percent.\n\nIn a poll conducted on Sunday, January 16. 2022, Claudio López (Unity Party) was able to achieve 41.2 percent, the New Democratic Alliance on the other hand was able to hit 57.5 percent. This leaves 16.3 points separating the two, with the NDA in first place. As of this date, 1.3 percent of the voters are undecided. So far, the Unity Party averaged 42.0 points, while their opponents averaged 57.0 points over the last 7 polls. The median is 42.0 (Isidorian Unity Party) and 57.0(New Democratic Alliance) respectively. Across all polls, the mean margin is 15.0, and the median 15.0 points.  The NDA are climbing away. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 40.0 was on January 10. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the New Democratic Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 41.2, New Democratic Alliance 57.5 percent.\n\nA poll from Sunday, January 16. 2022 showed that Claudio López (Unity Party) was able to achieve 41.2 percent, while Claudio López (Unity Party) reached 57.5 percent. This leaves 16.3 points separating the two. There are 1.3 percent undecided voters. The mean margin for all polls is 15.0, the median margin 15.0. The IUP's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n The poll numbers decreased by -0.8 points for Claudio López. \n\nIn a poll conducted on Saturday, January 15. 2022, Isabella Soler (Alliance) was able to achieve 57 percent, the Isidorian Unity Party on the other hand was able to hit 42.2 percent. This leaves 14.8 points separating the two, and shows Isabella Soler leading. There are 0.8 percent undecided voters. Over the last 6 polls, the average for New Democratic Alliance has been 57.0 points, whereas Unity Party has been averaging 42.0 points. Median results were 56.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party). Across all polls, the mean margin is 15.0, and the median 14.0 points. The New Democratic Alliance are widening the gap. The result improves by 1.0 points for the Alliance. The poll numbers decreased by -0.8 points for Claudio López. The Alliance's highest ever result, 60.0 was on January 10. 2022. The Unity Party's lowest ever result, 40.0 was on January 10. 2022. The margin widens by 1.8. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022.  \n \n Half Positive (NDA) \n \n The New Democratic Alliance gains 1.0 percentage points. \n\nIn a poll conducted on Saturday, January 15. 2022, Isabella Soler (New Democratic Alliance) reached 57 percent, the Isidorian Unity Party on the other hand was able to hit 42.2 percent. This leaves 14.8 points separating the two, and shows Isabella Soler in first place. So far, 0.8 percent of the voters have no preferred candidate. Over the last 6 polls, the average for Alliance has been 57.0 points, whereas IUP has been averaging 42.0 points. Median results were 56.0 (NDA) and 42.0 (IUP). Across all polls, the mean margin is 15.0, and the median 14.0 points. The lead is increasing. The result improves by 1.0 points for the New Democratic Alliance. The Unity Party lost -0.8 percentage points. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 40.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The margin widens by 1.8. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the NDA on January 10. 2022. The lowest result to date, 40.0 was set by the IUP on January 10. 2022.  \n \n Neutral (NDA) \n \n  Isabella Soler in the Lead\n\nA poll from Saturday, January 15. 2022 showed that Isabella Soler (Alliance) was able to achieve 57 percent, the Unity Party on the other hand was able to hit 42.2 percent. This produces a margin of 14.8 Points, and shows Isabella Soler in first place. As of this date, 0.8 percent of the voters are undecided. Over the last 6 polls, the average for New Democratic Alliance has been 57.0 points, whereas Unity Party has been averaging 42.0 points. Median results were 56.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party). Across all polls, the mean margin is 15.0, and the median 14.0 points.  The Alliance are climbing away. The result improves by 1.0 points for the Alliance. The poll numbers decreased by -0.8 points for Claudio López. The difference increased by 1.8. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022. The NDA's highest ever result, 60.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Unity Party's lowest ever result, 40.0 was on January 10. 2022.  \n \n Half Negative (NDA) \n \n Isidorian Unity Party scores 42.2, NDA 57 percent.\n\nIn a poll conducted on Saturday, January 15. 2022, Claudio López (IUP) was able to achieve 42.2 percent, the NDA on the other hand was able to hit 57 percent. This leaves 14.8 points separating the two, with the Alliance in first place. There are 0.8 percent undecided voters. So far, the Unity Party averaged 42.0 points, while their opponents averaged 57.0 points over the last 6 polls. The median is 42.0 (Isidorian Unity Party) and 56.0(New Democratic Alliance) respectively. Across all polls, the mean margin is 15.0, and the median 14.0 points.  The Alliance are climbing away. The IUP's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 40.0 was on January 10. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the New Democratic Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022.  \n \n Full negative (NDA) \n \n IUP scores 42.2, Alliance 57 percent.\n\nThe latest poll from Saturday, January 15. 2022 showed that Claudio López (Unity Party) reached 42.2 percent, the New Democratic Alliance on the other hand was able to hit 57 percent. This produces a margin of 14.8 Points. So far, 0.8 percent of the voters have no preferred candidate. The mean margin for all polls is 15.0, the median margin 14.0. The IUP's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Isabella Soler in the Lead\n\nA poll from Friday, January 14. 2022 showed that Isabella Soler (NDA) was able to achieve 56 percent, while Claudio López (Isidorian Unity Party) reached 43 percent. This produces a margin of 13.0 Points, and shows Isabella Soler leading. So far, 1.0 percent of the voters have no preferred candidate. So far, the New Democratic Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 5 polls. The median is 56.0 (New Democratic Alliance) and 42.0 (Unity Party) respectively. Across all polls, the mean margin is 15.0, and the median 14.0 points. This is the second-lowest difference between the two. The lead is increasing. The NDA gains 1.0 percentage points. The Unity Party lost -2.0 percentage points. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The IUP's lowest ever result, 40.0 was on January 10. 2022. The margin widens by 3.0. The New Democratic Alliance had a local low point in the previous poll at 55.0, and is now rising. After hitting a local high point, Unity Party's results are now decreasing. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022.  \n \n Half Positive (NDA) \n \n Isabella Soler in the Lead\n\nA poll from Friday, January 14. 2022 showed that Isabella Soler (NDA) reached 56 percent, while Claudio López (IUP) reached 43 percent. This produces a margin of 13.0 Points, and shows Isabella Soler leading. 1.0 percent of the voters have yet to decide. Over the last 5 polls, the average for Alliance has been 57.0 points, whereas Isidorian Unity Party has been averaging 42.0 points. Median results were 56.0 (Alliance) and 42.0 (Isidorian Unity Party). Across all polls, the mean margin is 15.0, and the median 14.0 points. This is the second-lowest difference between the two. The lead is getting bigger. The Alliance gains 1.0 percentage points. The poll numbers decreased by -2.0 points for Claudio López. The Alliance's highest ever result, 60.0 was on January 10. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The IUP's lowest ever result, 40.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The margin widens by 3.0. The NDA had a local low point in the previous poll at 55.0, and is now rising. The Unity Party had a local peak in the previous poll at 45.0, and is now sinking. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the New Democratic Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022.  \n \n Neutral (NDA) \n \n  Isabella Soler in the Lead\n\nA poll from Friday, January 14. 2022 showed that Isabella Soler (New Democratic Alliance) was able to achieve 56 percent, the IUP on the other hand was able to hit 43 percent. This leaves 13.0 points separating the two, with the New Democratic Alliance in first place. 1.0 percent of the voters have yet to decide. Over the last 5 polls, the average for NDA has been 57.0 points, whereas Unity Party has been averaging 42.0 points. Median results were 56.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party). Across all polls, the mean margin is 15.0, and the median 14.0 points. It marks the second smallest margin between the two.  The New Democratic Alliance are climbing away. The result improves by 1.0 points for the NDA. The poll numbers decreased by -2.0 points for Claudio López. The difference increased by 3.0. The NDA had a local low point in the previous poll at 55.0, and is now rising. After hitting a local high point, Isidorian Unity Party's results are now decreasing. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022.  \n \n Half Negative (NDA) \n \n Unity Party scores 43, Alliance 56 percent.\n\nThe latest poll from Friday, January 14. 2022 showed that Claudio López (Isidorian Unity Party) was able to achieve 43 percent, while Isabella Soler (NDA) reached 56 percent. This produces a margin of 13.0 Points, with the New Democratic Alliance in first place. As of this date, 1.0 percent of the voters are undecided. So far, the Isidorian Unity Party averaged 42.0 points, while their opponents averaged 57.0 points over the last 5 polls. The median is 42.0 (Unity Party) and 56.0(Alliance) respectively. The mean margin for all polls is 15.0, the median margin 14.0. The lead is increasing. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Alliance's highest ever result, 60.0 was on January 10. 2022. The New Democratic Alliance's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the NDA on January 10. 2022. The lowest result to date, 40.0 was set by the Isidorian Unity Party on January 10. 2022.  \n \n Full negative (NDA) \n \n Isidorian Unity Party scores 43, Alliance 56 percent.\n\nThe latest poll from Friday, January 14. 2022 showed that Claudio López (Isidorian Unity Party) reached 43 percent, while Claudio López (Isidorian Unity Party) reached 56 percent. This produces a margin of 13.0 Points. There are 1.0 percent undecided voters. The mean margin for all polls is 15.0, the median margin 14.0. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n Full Positive (NDA): \n \n Alliance leads Isidorian Unity Party with 55 to 45 percent \n\nFollowing a poll from Thursday, January 13. 2022, Isabella Soler (NDA) reached 55 percent, while Claudio López (Unity Party) reached 45 percent. This produces a margin of 10.0 Points, with the NDA in first place. 0.0 percent of the voters have yet to decide. So far, the Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 4 polls. The median is 57.0 (New Democratic Alliance) and 42.0 (Isidorian Unity Party) respectively. The mean margin for all polls is 15.0, the median margin 16.0. It is a neck and neck race, more than ever before. The Alliance's highest ever result, 60.0 was on January 10. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the New Democratic Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022.  \n \n Half Positive (NDA) \n \n New Democratic Alliance leads Isidorian Unity Party with 55 to 45 percent \n\nFollowing a poll from Thursday, January 13. 2022, Isabella Soler (New Democratic Alliance) reached 55 percent, the IUP on the other hand was able to hit 45 percent. This produces a margin of 10.0 Points, with the NDA in first place. There are 0.0 percent undecided voters. So far, the NDA averaged 57.0 points, while their opponents averaged 42.0 points over the last 4 polls. The median is 57.0 (New Democratic Alliance) and 42.0 (Unity Party) respectively. Across all polls, the mean margin is 15.0, and the median 16.0 points. The race has never been this close. The NDA's highest ever result, 60.0 was on January 10. 2022. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022.  \n \n Neutral (NDA) \n \n  The Alliance lost -0.5 percentage points. \n\nIn a poll conducted on Thursday, January 13. 2022, Isabella Soler (NDA) reached 55 percent, while Claudio López (IUP) reached 45 percent. This produces a margin of 10.0 Points, with the Alliance in first place. There are 0.0 percent undecided voters. So far, the New Democratic Alliance averaged 57.0 points, while their opponents averaged 42.0 points over the last 4 polls. The median is 57.0 (Alliance) and 42.0 (Unity Party) respectively. Across all polls, the mean margin is 15.0, and the median 16.0 points. A result this low has not been achieved so far by the New Democratic Alliance. The contestants are separated by a hair thin margin.  The Isidorian Unity Party is inching up to the Alliance. The poll numbers decreased by -0.5 points for Isabella Soler. The result improves by 3.0 points for the IUP. The difference decreased by -3.5. So far, the divide was never larger than on January 10. 2022 with 20.0 points between both. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the Unity Party on January 10. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The Isidorian Unity Party's lowest ever result, 40.0 was on January 10. 2022.  \n \n Half Negative (NDA) \n \n The difference decreased by -3.5. \n\nIn a poll conducted on Thursday, January 13. 2022, Claudio López (Unity Party) reached 45 percent, while Isabella Soler (NDA) reached 55 percent. This produces a margin of 10.0 Points, and shows Isabella Soler leading. 0.0 percent of the voters have yet to decide. So far, the Isidorian Unity Party averaged 42.0 points, while their opponents averaged 57.0 points over the last 4 polls. The median is 42.0 (Isidorian Unity Party) and 57.0(Alliance) respectively. Across all polls, the mean margin is 15.0, and the median 16.0 points. This is a record low result for the Alliance. The points have hit rock bottom for the Unity Party. The margin is decreasing. The Unity Party gains 3.0 percentage points. The NDA lost -0.5 percentage points. The Isidorian Unity Party's highest ever result, 45.0 was on January 13. 2022. The New Democratic Alliance's highest ever result, 60.0 was on January 10. 2022. The NDA's lowest ever result, 55.0 was on January 13. 2022. The IUP's lowest ever result, 40.0 was on January 10. 2022. The difference decreased by -3.5. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents. The highest result so far, 60.0 was achieved by the Alliance on January 10. 2022. The lowest result to date, 40.0 was set by the IUP on January 10. 2022.  \n \n Full negative (NDA) \n \n The poll numbers decreased by -0.5 points for Isabella Soler. \n\nThe latest poll from Thursday, January 13. 2022 showed that Claudio López (IUP) reached 45 percent, while Claudio López (Unity Party) reached 55 percent. This produces a margin of 10.0 Points. As of this date, 0.0 percent of the voters are undecided. Across all polls, the mean margin is 15.0, and the median 16.0 points. This is a historically low result for the New Democratic Alliance.  The Isidorian Unity Party is inching up to the New Democratic Alliance. The IUP gains 3.0 percentage points. The poll numbers decreased by -0.5 points for Isabella Soler. The Unity Party's highest ever result, 45.0 was on January 13. 2022. The Alliance's lowest ever result, 55.0 was on January 13. 2022. The margin narrows by -3.5. At no date has the race been closer than January 13. 2022, when only 10.0 points separated the opponents.  \n \n "